Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
#ifndef _RTL8735B_DPI_TYPE_H_
#define _RTL8735B_DPI_TYPE_H_

/**************************************************************************//**
 * @defgroup DPI_CRT_CTL
 * @brief  CRT_CTL                                   (@ 0X000)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_MCK_CKE_SEL                        30
#define DPI_BIT_MCK_CKE_SEL                          ((u32)0x00000001 << 30)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CLK_TEN_VALUE                      29
#define DPI_BIT_CLK_TEN_VALUE                        ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CLK_TEN_MODE                       28
#define DPI_BIT_CLK_TEN_MODE                         ((u32)0x00000001 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_FORCE_RSTN                         27
#define DPI_BIT_FORCE_RSTN                           ((u32)0x00000001 << 27)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_RSTN_VALUE                         26
#define DPI_BIT_RSTN_VALUE                           ((u32)0x00000001 << 26)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_FIFO_RST_INI_TX                    23
#define DPI_MASK_FIFO_RST_INI_TX                     ((u32)0x00000007 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_FIFO_RST_INI_RX                    20
#define DPI_MASK_FIFO_RST_INI_RX                     ((u32)0x00000007 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CA_DDR3_MODE                       19
#define DPI_BIT_CA_DDR3_MODE                         ((u32)0x00000001 << 19)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_FORCE_CKE_1                        18
#define DPI_BIT_FORCE_CKE_1                          ((u32)0x00000001 << 18)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_CKE_1_VALUE                        17
#define DPI_BIT_CKE_1_VALUE                          ((u32)0x00000001 << 17)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_FORCE_CS                           16
#define DPI_BIT_FORCE_CS                             ((u32)0x00000001 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_VALUE                           15
#define DPI_BIT_CS_VALUE                             ((u32)0x00000001 << 15)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_FORCE_CS_1                         14
#define DPI_BIT_FORCE_CS_1                           ((u32)0x00000001 << 14)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_1_VALUE                         13
#define DPI_BIT_CS_1_VALUE                           ((u32)0x00000001 << 13)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_PAD_DDR2_MODE                      12
#define DPI_BIT_PAD_DDR2_MODE                        ((u32)0x00000001 << 12)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_FORCE_CKE                          11
#define DPI_BIT_FORCE_CKE                            ((u32)0x00000001 << 11)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_CKE_VALUE                          10
#define DPI_BIT_CKE_VALUE                            ((u32)0x00000001 << 10)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_PIN_MUX_LPDDR3_2CELL               9
#define DPI_BIT_PIN_MUX_LPDDR3_2CELL                 ((u32)0x00000001 << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_PIN_MUX_LPDDR3_1CELL               8
#define DPI_BIT_PIN_MUX_LPDDR3_1CELL                 ((u32)0x00000001 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_PIN_MUX_LPDDR2_2CELL               7
#define DPI_BIT_PIN_MUX_LPDDR2_2CELL                 ((u32)0x00000001 << 7)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_PIN_MUX_LPDDR2_1CELL               6
#define DPI_BIT_PIN_MUX_LPDDR2_1CELL                 ((u32)0x00000001 << 6)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_PIN_MUX_DDR3                       5
#define DPI_BIT_PIN_MUX_DDR3                         ((u32)0x00000001 << 5)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_PIN_MUX_MODE                       4
#define DPI_BIT_PIN_MUX_MODE                         ((u32)0x00000001 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_LPDDR_EN                           3
#define DPI_BIT_LPDDR_EN                             ((u32)0x00000001 << 3)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DAT_RATE_SEL                       2
#define DPI_BIT_DAT_RATE_SEL                         ((u32)0x00000001 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DDR2_EN                            1
#define DPI_BIT_DDR2_EN                              ((u32)0x00000001 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DDR3_MODE                          0
#define DPI_BIT_DDR3_MODE                            ((u32)0x00000001 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PLL_CTL0
 * @brief  PLL_CTL0                                  (@ 0X004)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_TMUX_DCG_EN                        28
#define DPI_BIT_TMUX_DCG_EN                          ((u32)0x00000001 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CA_AFIFO_DCG_EN                    23
#define DPI_BIT_CA_AFIFO_DCG_EN                      ((u32)0x00000001 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CA_AFIFO_DCG_CNT                   20
#define DPI_MASK_CA_AFIFO_DCG_CNT                    ((u32)0x00000007 << 20)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_MCK_CLK_EN                         0
#define DPI_MASK_MCK_CLK_EN                          ((u32)0x00001FFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PLL_CTL1
 * @brief  PLL_CTL1                                  (@ 0X008)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_MCK_MC_EN                          31
#define DPI_BIT_MCK_MC_EN                            ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_REG_FIX_DIV1                       30
#define DPI_BIT_REG_FIX_DIV1                         ((u32)0x00000001 << 30)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_REG_CRT_PWROFF_DIS                 29
#define DPI_BIT_REG_CRT_PWROFF_DIS                   ((u32)0x00000001 << 29)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_CLK_OE                             16
#define DPI_MASK_CLK_OE                              ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_OESYNC_OP_SEL_FIX                  13
#define DPI_BIT_OESYNC_OP_SEL_FIX                    ((u32)0x00000001 << 13)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_OESYNC_OP_SEL                      0
#define DPI_MASK_OESYNC_OP_SEL                       ((u32)0x00001FFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PLL_CTL2
 * @brief  PLL_CTL2                                  (@ 0X00C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_REG_CTS_FIFO_SYNC_CNT              29
#define DPI_MASK_REG_CTS_FIFO_SYNC_CNT               ((u32)0x00000007 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_PRBS_EN                            28
#define DPI_BIT_PRBS_EN                              ((u32)0x00000001 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_NC_SEL                             26
#define DPI_MASK_NC_SEL                              ((u32)0x00000003 << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_NC_CLK_DIV_SEL                     24
#define DPI_MASK_NC_CLK_DIV_SEL                      ((u32)0x00000003 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_NC_PRBS13_SEED                     11
#define DPI_MASK_NC_PRBS13_SEED                      ((u32)0x00001FFF << 11)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_NC_PRBS13_EN                       10
#define DPI_BIT_NC_PRBS13_EN                         ((u32)0x00000001 << 10)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_NC_PRBS13_INVS                     9
#define DPI_BIT_NC_PRBS13_INVS                       ((u32)0x00000001 << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_NC_PRBS13_MAX                      8
#define DPI_BIT_NC_PRBS13_MAX                        ((u32)0x00000001 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_PLL_DUM                            0
#define DPI_MASK_PLL_DUM                             ((u32)0x000000FF << 0)                              /*!<R/W 0xF  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PLL_PI0
 * @brief  PLL_PI0                                   (@ 0X010)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_POST_PI_SEL3                       24
#define DPI_MASK_POST_PI_SEL3                        ((u32)0x0000001F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_SEL2                       16
#define DPI_MASK_POST_PI_SEL2                        ((u32)0x0000001F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_SEL1                       8
#define DPI_MASK_POST_PI_SEL1                        ((u32)0x0000001F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_SEL0                       0
#define DPI_MASK_POST_PI_SEL0                        ((u32)0x0000001F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PLL_PI1
 * @brief  PLL_PI1                                   (@ 0X014)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_POST_PI_SEL                        24
#define DPI_MASK_POST_PI_SEL                         ((u32)0x0000001F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_SEL6                       16
#define DPI_MASK_POST_PI_SEL6                        ((u32)0x0000001F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_SEL5                       8
#define DPI_MASK_POST_PI_SEL5                        ((u32)0x0000001F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_SEL4                       0
#define DPI_MASK_POST_PI_SEL4                        ((u32)0x0000001F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PLL_CTL3
 * @brief  PLL_CTL3                                  (@ 0X018)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_V11_LDO_VSEL                       29
#define DPI_MASK_V11_LDO_VSEL                        ((u32)0x00000007 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKREF_SEL                          28
#define DPI_BIT_CKREF_SEL                            ((u32)0x00000001 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_RS                         27
#define DPI_BIT_POST_PI_RS                           ((u32)0x00000001 << 27)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_RL                         25
#define DPI_MASK_POST_PI_RL                          ((u32)0x00000003 << 25)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_PI_BIAS                       23
#define DPI_MASK_POST_PI_BIAS                        ((u32)0x00000003 << 23)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PLL_SEL_CPMODE                     22
#define DPI_BIT_PLL_SEL_CPMODE                       ((u32)0x00000001 << 22)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_PLL_LDO_VSEL                       19
#define DPI_MASK_PLL_LDO_VSEL                        ((u32)0x00000007 << 19)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PLL_DBUG_EN                        18
#define DPI_BIT_PLL_DBUG_EN                          ((u32)0x00000001 << 18)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_PDIV                               16
#define DPI_MASK_PDIV                                ((u32)0x00000003 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_LPF_SR                             13
#define DPI_MASK_LPF_SR                              ((u32)0x00000007 << 13)                             /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_LPF_CP                             12
#define DPI_BIT_LPF_CP                               ((u32)0x00000001 << 12)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_LOOP_PI_ISEL                       8
#define DPI_MASK_LOOP_PI_ISEL                        ((u32)0x0000000F << 8)                              /*!<R/W 0x6  RSVD */
#define DPI_SHIFT_ICP                                4
#define DPI_MASK_ICP                                 ((u32)0x0000000F << 4)                              /*!<R/W 0xC  RSVD */
#define DPI_SHIFT_CCO_KVCO                           2
#define DPI_BIT_CCO_KVCO                             ((u32)0x00000001 << 2)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_CCO_BAND                           0
#define DPI_MASK_CCO_BAND                            ((u32)0x00000003 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_SSC0
 * @brief  SSC0                                      (@ 0X01C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_OC_DONE_DELAY                      8
#define DPI_MASK_OC_DONE_DELAY                       ((u32)0x0000003F << 8)                              /*!<R/W 0x3F  RSVD */
#define DPI_SHIFT_HS_OC_STOP_DIFF                    6
#define DPI_MASK_HS_OC_STOP_DIFF                     ((u32)0x00000003 << 6)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_SEL_OC_MODE                        4
#define DPI_MASK_SEL_OC_MODE                         ((u32)0x00000003 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_SSC_FLAG_INIT                      3
#define DPI_BIT_SSC_FLAG_INIT                        ((u32)0x00000001 << 3)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ORDER                              2
#define DPI_BIT_ORDER                                ((u32)0x00000001 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_EN_SSC                             1
#define DPI_BIT_EN_SSC                               ((u32)0x00000001 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_BYPASS_PI                          0
#define DPI_BIT_BYPASS_PI                            ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_SSC1
 * @brief  SSC1                                      (@ 0X020)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_GRAN_AUTO_RST                      23
#define DPI_BIT_GRAN_AUTO_RST                        ((u32)0x00000001 << 23)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DOT_GRAN                           20
#define DPI_MASK_DOT_GRAN                            ((u32)0x00000007 << 20)                             /*!<R/W 0x4  RSVD */
#define DPI_SHIFT_GRAN_SET                           0
#define DPI_MASK_GRAN_SET                            ((u32)0x0007FFFF << 0)                              /*!<R/W 0x21FB  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_SSC2
 * @brief  SSC2                                      (@ 0X024)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_F_CODE_T                           16
#define DPI_MASK_F_CODE_T                            ((u32)0x000007FF << 16)                             /*!<R/W 0x50A  RSVD */
#define DPI_SHIFT_F_CODE                             0
#define DPI_MASK_F_CODE                              ((u32)0x000007FF << 0)                              /*!<R/W 0x5ED  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_SSC3
 * @brief  SSC3                                      (@ 0X028)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_OC_EN                              26
#define DPI_BIT_OC_EN                                ((u32)0x00000001 << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_OC_STEP_SET                        16
#define DPI_MASK_OC_STEP_SET                         ((u32)0x000003FF << 16)                             /*!<R/W 0x28  RSVD */
#define DPI_SHIFT_N_CODE_T                           8
#define DPI_MASK_N_CODE_T                            ((u32)0x000000FF << 8)                              /*!<R/W 0x1A  RSVD */
#define DPI_SHIFT_N_CODE                             0
#define DPI_MASK_N_CODE                              ((u32)0x000000FF << 0)                              /*!<R/W 0x19  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_WDOG
 * @brief  WDOG                                      (@ 0X02C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_TIME2_RST_WIDTH                    12
#define DPI_MASK_TIME2_RST_WIDTH                     ((u32)0x00000003 << 12)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_TIME_RDY_CKOUT                     8
#define DPI_MASK_TIME_RDY_CKOUT                      ((u32)0x00000003 << 8)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_TIME0_CK                           4
#define DPI_MASK_TIME0_CK                            ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_F390K                              1
#define DPI_MASK_F390K                               ((u32)0x00000003 << 1)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_WD_ENABLE                          0
#define DPI_BIT_WD_ENABLE                            ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_CMD
 * @brief  DCC_CMD                                   (@ 0X030)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_CMD_DSP_DBG_SEL                31
#define DPI_BIT_DCC_CMD_DSP_DBG_SEL                  ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_CMD_DUTY_SEL                   29
#define DPI_BIT_DCC_CMD_DUTY_SEL                     ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_CMD_DSP_STOP                   28
#define DPI_BIT_DCC_CMD_DSP_STOP                     ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_CMD_DIV                        24
#define DPI_MASK_DCC_CMD_DIV                         ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_CMD_INT_GAIN                   16
#define DPI_MASK_DCC_CMD_INT_GAIN                    ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_CMD_DUTY                       8
#define DPI_MASK_DCC_CMD_DUTY                        ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_CMD_DUTY_PRESETB               4
#define DPI_MASK_DCC_CMD_DUTY_PRESETB                ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_CMD_DUTY_PRESETA               0
#define DPI_MASK_DCC_CMD_DUTY_PRESETA                ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_DQS_0
 * @brief  DCC_DQS_0                                 (@ 0X034)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_DQS_DUTY_SEL                   29
#define DPI_BIT_DCC_DQS_DUTY_SEL                     ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_DQS_DSP_STOP                   28
#define DPI_BIT_DCC_DQS_DSP_STOP                     ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_DQS_DIV                        24
#define DPI_MASK_DCC_DQS_DIV                         ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQS_INT_GAIN                   16
#define DPI_MASK_DCC_DQS_INT_GAIN                    ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY                       8
#define DPI_MASK_DCC_DQS_DUTY                        ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY_PRESETB               4
#define DPI_MASK_DCC_DQS_DUTY_PRESETB                ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY_PRESETA               0
#define DPI_MASK_DCC_DQS_DUTY_PRESETA                ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

