Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup DPI_DCC_DQS_1
 * @brief  DCC_DQS_1                                 (@ 0X038)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_DQS_DUTY_SEL                   29
#define DPI_BIT_DCC_DQS_DUTY_SEL                     ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_DQS_DSP_STOP                   28
#define DPI_BIT_DCC_DQS_DSP_STOP                     ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_DQS_DIV                        24
#define DPI_MASK_DCC_DQS_DIV                         ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQS_INT_GAIN                   16
#define DPI_MASK_DCC_DQS_INT_GAIN                    ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY                       8
#define DPI_MASK_DCC_DQS_DUTY                        ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY_PRESETB               4
#define DPI_MASK_DCC_DQS_DUTY_PRESETB                ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY_PRESETA               0
#define DPI_MASK_DCC_DQS_DUTY_PRESETA                ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_DQS_2
 * @brief  DCC_DQS_2                                 (@ 0X03C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_DQS_DUTY_SEL                   29
#define DPI_BIT_DCC_DQS_DUTY_SEL                     ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_DQS_DSP_STOP                   28
#define DPI_BIT_DCC_DQS_DSP_STOP                     ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_DQS_DIV                        24
#define DPI_MASK_DCC_DQS_DIV                         ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQS_INT_GAIN                   16
#define DPI_MASK_DCC_DQS_INT_GAIN                    ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY                       8
#define DPI_MASK_DCC_DQS_DUTY                        ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY_PRESETB               4
#define DPI_MASK_DCC_DQS_DUTY_PRESETB                ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY_PRESETA               0
#define DPI_MASK_DCC_DQS_DUTY_PRESETA                ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_DQS_3
 * @brief  DCC_DQS_3                                 (@ 0X040)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_DQS_DUTY_SEL                   29
#define DPI_BIT_DCC_DQS_DUTY_SEL                     ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_DQS_DSP_STOP                   28
#define DPI_BIT_DCC_DQS_DSP_STOP                     ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_DQS_DIV                        24
#define DPI_MASK_DCC_DQS_DIV                         ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQS_INT_GAIN                   16
#define DPI_MASK_DCC_DQS_INT_GAIN                    ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY                       8
#define DPI_MASK_DCC_DQS_DUTY                        ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY_PRESETB               4
#define DPI_MASK_DCC_DQS_DUTY_PRESETB                ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_DQS_DUTY_PRESETA               0
#define DPI_MASK_DCC_DQS_DUTY_PRESETA                ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_DQ_0
 * @brief  DCC_DQ_0                                  (@ 0X044)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_DQ_DUTY_SEL                    29
#define DPI_BIT_DCC_DQ_DUTY_SEL                      ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_DQ_DSP_STOP                    28
#define DPI_BIT_DCC_DQ_DSP_STOP                      ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_DQ_DIV                         24
#define DPI_MASK_DCC_DQ_DIV                          ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQ_INT_GAIN                    16
#define DPI_MASK_DCC_DQ_INT_GAIN                     ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY                        8
#define DPI_MASK_DCC_DQ_DUTY                         ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY_PRESETB                4
#define DPI_MASK_DCC_DQ_DUTY_PRESETB                 ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY_PRESETA                0
#define DPI_MASK_DCC_DQ_DUTY_PRESETA                 ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_DQ_1
 * @brief  DCC_DQ_1                                  (@ 0X048)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_DQ_DUTY_SEL                    29
#define DPI_BIT_DCC_DQ_DUTY_SEL                      ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_DQ_DSP_STOP                    28
#define DPI_BIT_DCC_DQ_DSP_STOP                      ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_DQ_DIV                         24
#define DPI_MASK_DCC_DQ_DIV                          ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQ_INT_GAIN                    16
#define DPI_MASK_DCC_DQ_INT_GAIN                     ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY                        8
#define DPI_MASK_DCC_DQ_DUTY                         ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY_PRESETB                4
#define DPI_MASK_DCC_DQ_DUTY_PRESETB                 ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY_PRESETA                0
#define DPI_MASK_DCC_DQ_DUTY_PRESETA                 ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_DQ_2
 * @brief  DCC_DQ_2                                  (@ 0X04C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_DQ_DUTY_SEL                    29
#define DPI_BIT_DCC_DQ_DUTY_SEL                      ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_DQ_DSP_STOP                    28
#define DPI_BIT_DCC_DQ_DSP_STOP                      ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_DQ_DIV                         24
#define DPI_MASK_DCC_DQ_DIV                          ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQ_INT_GAIN                    16
#define DPI_MASK_DCC_DQ_INT_GAIN                     ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY                        8
#define DPI_MASK_DCC_DQ_DUTY                         ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY_PRESETB                4
#define DPI_MASK_DCC_DQ_DUTY_PRESETB                 ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY_PRESETA                0
#define DPI_MASK_DCC_DQ_DUTY_PRESETA                 ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_DQ_3
 * @brief  DCC_DQ_3                                  (@ 0X050)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_DQ_DUTY_SEL                    29
#define DPI_BIT_DCC_DQ_DUTY_SEL                      ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_DQ_DSP_STOP                    28
#define DPI_BIT_DCC_DQ_DSP_STOP                      ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_DQ_DIV                         24
#define DPI_MASK_DCC_DQ_DIV                          ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQ_INT_GAIN                    16
#define DPI_MASK_DCC_DQ_INT_GAIN                     ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY                        8
#define DPI_MASK_DCC_DQ_DUTY                         ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY_PRESETB                4
#define DPI_MASK_DCC_DQ_DUTY_PRESETB                 ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_DQ_DUTY_PRESETA                0
#define DPI_MASK_DCC_DQ_DUTY_PRESETA                 ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_CK_0
 * @brief  DCC_CK_0                                  (@ 0X054)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_CK_DUTY_SEL                    29
#define DPI_BIT_DCC_CK_DUTY_SEL                      ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_CK_DSP_STOP                    28
#define DPI_BIT_DCC_CK_DSP_STOP                      ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_CK_DIV                         24
#define DPI_MASK_DCC_CK_DIV                          ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_CK_INT_GAIN                    16
#define DPI_MASK_DCC_CK_INT_GAIN                     ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_CK_DUTY                        8
#define DPI_MASK_DCC_CK_DUTY                         ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_CK_DUTY_PRESETB                4
#define DPI_MASK_DCC_CK_DUTY_PRESETB                 ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_CK_DUTY_PRESETA                0
#define DPI_MASK_DCC_CK_DUTY_PRESETA                 ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_CK_1
 * @brief  DCC_CK_1                                  (@ 0X058)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_CK_DUTY_SEL                    29
#define DPI_BIT_DCC_CK_DUTY_SEL                      ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_CK_DSP_STOP                    28
#define DPI_BIT_DCC_CK_DSP_STOP                      ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_CK_DIV                         24
#define DPI_MASK_DCC_CK_DIV                          ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_CK_INT_GAIN                    16
#define DPI_MASK_DCC_CK_INT_GAIN                     ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_CK_DUTY                        8
#define DPI_MASK_DCC_CK_DUTY                         ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_CK_DUTY_PRESETB                4
#define DPI_MASK_DCC_CK_DUTY_PRESETB                 ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_CK_DUTY_PRESETA                0
#define DPI_MASK_DCC_CK_DUTY_PRESETA                 ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CRT_CTL_2
 * @brief  CRT_CTL_2                                 (@ 0X060)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_MCK_TEST_CLK_SEL                   28
#define DPI_MASK_MCK_TEST_CLK_SEL                    ((u32)0x0000000F << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ALERT_CHK_EN                       3
#define DPI_BIT_ALERT_CHK_EN                         ((u32)0x00000001 << 3)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TOPREG_CLK_DIS                     1
#define DPI_BIT_TOPREG_CLK_DIS                       ((u32)0x00000001 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_RWREG_CLK_DIS                      0
#define DPI_BIT_RWREG_CLK_DIS                        ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_AFIFO_STR_0
 * @brief  AFIFO_STR_0                               (@ 0X080)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_RD_STR_NUM_3                   28
#define DPI_MASK_DQS_RD_STR_NUM_3                    ((u32)0x00000007 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DQ_RD_STR_NUM_3                    24
#define DPI_MASK_DQ_RD_STR_NUM_3                     ((u32)0x00000007 << 24)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DQS_RD_STR_NUM_2                   20
#define DPI_MASK_DQS_RD_STR_NUM_2                    ((u32)0x00000007 << 20)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DQ_RD_STR_NUM_2                    16
#define DPI_MASK_DQ_RD_STR_NUM_2                     ((u32)0x00000007 << 16)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DQS_RD_STR_NUM_1                   12
#define DPI_MASK_DQS_RD_STR_NUM_1                    ((u32)0x00000007 << 12)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DQ_RD_STR_NUM_1                    8
#define DPI_MASK_DQ_RD_STR_NUM_1                     ((u32)0x00000007 << 8)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_DQS_RD_STR_NUM_0                   4
#define DPI_MASK_DQS_RD_STR_NUM_0                    ((u32)0x00000007 << 4)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_DQ_RD_STR_NUM_0                    0
#define DPI_MASK_DQ_RD_STR_NUM_0                     ((u32)0x00000007 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_AFIFO_STR_1
 * @brief  AFIFO_STR_1                               (@ 0X084)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_BYPASS_EN_RX                       21
#define DPI_BIT_BYPASS_EN_RX                         ((u32)0x00000001 << 21)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_BYPASS_EN_TX                       20
#define DPI_BIT_BYPASS_EN_TX                         ((u32)0x00000001 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_FORCE_RST_N_RX                     19
#define DPI_BIT_FORCE_RST_N_RX                       ((u32)0x00000001 << 19)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_FORCE_RST_N_TX                     18
#define DPI_BIT_FORCE_RST_N_TX                       ((u32)0x00000001 << 18)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_REF_RST_EN_RX                      17
#define DPI_BIT_REF_RST_EN_RX                        ((u32)0x00000001 << 17)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_REF_RST_EN_TX                      16
#define DPI_BIT_REF_RST_EN_TX                        ((u32)0x00000001 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CMD_RD_STR_NUM_SEL_H               8
#define DPI_MASK_CMD_RD_STR_NUM_SEL_H                ((u32)0x000000FF << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CMD_EX_RD_STR_NUM                  4
#define DPI_MASK_CMD_EX_RD_STR_NUM                   ((u32)0x00000007 << 4)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_CMD_RD_STR_NUM                     0
#define DPI_MASK_CMD_RD_STR_NUM                      ((u32)0x00000007 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_AFIFO_STR_2
 * @brief  AFIFO_STR_2                               (@ 0X088)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RX_RD_STR_NUM_3                    12
#define DPI_MASK_RX_RD_STR_NUM_3                     ((u32)0x00000007 << 12)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_RX_RD_STR_NUM_2                    8
#define DPI_MASK_RX_RD_STR_NUM_2                     ((u32)0x00000007 << 8)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_RX_RD_STR_NUM_1                    4
#define DPI_MASK_RX_RD_STR_NUM_1                     ((u32)0x00000007 << 4)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_RX_RD_STR_NUM_0                    0
#define DPI_MASK_RX_RD_STR_NUM_0                     ((u32)0x00000007 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CRT_RST_CTL
 * @brief  CRT_RST_CTL                               (@ 0X08C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_PLL_BG_LPF                         11
#define DPI_BIT_PLL_BG_LPF                           ((u32)0x00000001 << 11)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_PLL_BG                             9
#define DPI_MASK_PLL_BG                              ((u32)0x00000003 << 9)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_PLL_BG_RST_N                       8
#define DPI_BIT_PLL_BG_RST_N                         ((u32)0x00000001 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_POW_LDO_V11                        5
#define DPI_BIT_POW_LDO_V11                          ((u32)0x00000001 << 5)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_POW_LDO_PLL                        4
#define DPI_BIT_POW_LDO_PLL                          ((u32)0x00000001 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_PTR_RST_N                          3
#define DPI_BIT_PTR_RST_N                            ((u32)0x00000001 << 3)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_RST_N                              2
#define DPI_BIT_RST_N                                ((u32)0x00000001 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_PLL_SSC_DIG_RST_N                  1
#define DPI_BIT_PLL_SSC_DIG_RST_N                    ((u32)0x00000001 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_PLL_LDO_RST_N                      0
#define DPI_BIT_PLL_LDO_RST_N                        ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_AFIFO_STR_SEL
 * @brief  AFIFO_STR_SEL                             (@ 0X094)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CMD_RD_STR_NUM_SEL                 0
#define DPI_MASK_CMD_RD_STR_NUM_SEL                  ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PLL_PI2
 * @brief  PLL_PI2                                   (@ 0X098)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_POST_PI_SEL10                      24
#define DPI_MASK_POST_PI_SEL10                       ((u32)0x0000001F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_SEL9                       16
#define DPI_MASK_POST_PI_SEL9                        ((u32)0x0000001F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_SEL8                       8
#define DPI_MASK_POST_PI_SEL8                        ((u32)0x0000001F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_SEL7                       0
#define DPI_MASK_POST_PI_SEL7                        ((u32)0x0000001F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PLL_CTL4
 * @brief  PLL_CTL4                                  (@ 0X09C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CLK_PI_CTRL                        31
#define DPI_BIT_CLK_PI_CTRL                          ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DLY_SEL                            24
#define DPI_MASK_DLY_SEL                             ((u32)0x0000001F << 24)                             /*!<R/W 0x10  RSVD */
#define DPI_SHIFT_DLY_SEL_CK1                        16
#define DPI_MASK_DLY_SEL_CK1                         ((u32)0x0000001F << 16)                             /*!<R/W 0x10  RSVD */
#define DPI_SHIFT_EN_POST_PI                         0
#define DPI_MASK_EN_POST_PI                          ((u32)0x00003FFF << 0)                              /*!<R/W 0x3FFF  RSVD */
/** @} */

