Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup DPI_PLL_PI3
 * @brief  PLL_PI3                                   (@ 0X0A0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_POST_PI_SEL12                      8
#define DPI_MASK_POST_PI_SEL12                       ((u32)0x0000001F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_POST_PI_SEL11                      0
#define DPI_MASK_POST_PI_SEL11                       ((u32)0x0000001F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_CS
 * @brief  DCC_CS                                    (@ 0X0A4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_CS_DSP_DBG_SEL                 31
#define DPI_BIT_DCC_CS_DSP_DBG_SEL                   ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_CS_DUTY_SEL                    29
#define DPI_BIT_DCC_CS_DUTY_SEL                      ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_CS_DSP_STOP                    28
#define DPI_BIT_DCC_CS_DSP_STOP                      ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_CS_DIV                         24
#define DPI_MASK_DCC_CS_DIV                          ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_CS_INT_GAIN                    16
#define DPI_MASK_DCC_CS_INT_GAIN                     ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_CS_DUTY                        8
#define DPI_MASK_DCC_CS_DUTY                         ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_CS_DUTY_PRESETB                4
#define DPI_MASK_DCC_CS_DUTY_PRESETB                 ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_CS_DUTY_PRESETA                0
#define DPI_MASK_DCC_CS_DUTY_PRESETA                 ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DCC_CS1
 * @brief  DCC_CS1                                   (@ 0X0A8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_CS_1_DSP_DBG_SEL               31
#define DPI_BIT_DCC_CS_1_DSP_DBG_SEL                 ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_CS_1_DUTY_SEL                  29
#define DPI_BIT_DCC_CS_1_DUTY_SEL                    ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DCC_CS_1_DSP_STOP                  28
#define DPI_BIT_DCC_CS_1_DSP_STOP                    ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCC_CS_1_DIV                       24
#define DPI_MASK_DCC_CS_1_DIV                        ((u32)0x00000007 << 24)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_CS_1_INT_GAIN                  16
#define DPI_MASK_DCC_CS_1_INT_GAIN                   ((u32)0x0000001F << 16)                             /*!<R/W 0x5  RSVD */
#define DPI_SHIFT_DCC_CS_1_DUTY                      8
#define DPI_MASK_DCC_CS_1_DUTY                       ((u32)0x0000007F << 8)                              /*!<R/W 0x38  RSVD */
#define DPI_SHIFT_DCC_CS_1_DUTY_PRESETB              4
#define DPI_MASK_DCC_CS_1_DUTY_PRESETB               ((u32)0x00000007 << 4)                              /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DCC_CS_1_DUTY_PRESETA              0
#define DPI_MASK_DCC_CS_1_DUTY_PRESETA               ((u32)0x00000007 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PLL_CTL5
 * @brief  PLL_CTL5                                  (@ 0X0AC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_PWROFF_PWR_WAIT_CYCLE              12
#define DPI_MASK_PWROFF_PWR_WAIT_CYCLE               ((u32)0x00000007 << 12)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PWROFF_RD_WAIT_CYCLE               9
#define DPI_MASK_PWROFF_RD_WAIT_CYCLE                ((u32)0x00000007 << 9)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PWROFF_WR_WAIT_CYCLE               6
#define DPI_MASK_PWROFF_WR_WAIT_CYCLE                ((u32)0x00000007 << 6)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_RW_PWROFF_MODE                     4
#define DPI_MASK_RW_PWROFF_MODE                      ((u32)0x00000003 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CA_PWROFF_MODE                     2
#define DPI_MASK_CA_PWROFF_MODE                      ((u32)0x00000003 << 2)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_DLY_0
 * @brief  ADR_DLY_0                                 (@ 0X100)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR07_DLY_SEL                      28
#define DPI_MASK_ADR07_DLY_SEL                       ((u32)0x0000000F << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR06_DLY_SEL                      24
#define DPI_MASK_ADR06_DLY_SEL                       ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR05_DLY_SEL                      20
#define DPI_MASK_ADR05_DLY_SEL                       ((u32)0x0000000F << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR04_DLY_SEL                      16
#define DPI_MASK_ADR04_DLY_SEL                       ((u32)0x0000000F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR03_DLY_SEL                      12
#define DPI_MASK_ADR03_DLY_SEL                       ((u32)0x0000000F << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR02_DLY_SEL                      8
#define DPI_MASK_ADR02_DLY_SEL                       ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR01_DLY_SEL                      4
#define DPI_MASK_ADR01_DLY_SEL                       ((u32)0x0000000F << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR00_DLY_SEL                      0
#define DPI_MASK_ADR00_DLY_SEL                       ((u32)0x0000000F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_DLY_1
 * @brief  ADR_DLY_1                                 (@ 0X104)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR15_DLY_SEL                      28
#define DPI_MASK_ADR15_DLY_SEL                       ((u32)0x0000000F << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR14_DLY_SEL                      24
#define DPI_MASK_ADR14_DLY_SEL                       ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR13_DLY_SEL                      20
#define DPI_MASK_ADR13_DLY_SEL                       ((u32)0x0000000F << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR12_DLY_SEL                      16
#define DPI_MASK_ADR12_DLY_SEL                       ((u32)0x0000000F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR11_DLY_SEL                      12
#define DPI_MASK_ADR11_DLY_SEL                       ((u32)0x0000000F << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR10_DLY_SEL                      8
#define DPI_MASK_ADR10_DLY_SEL                       ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR09_DLY_SEL                      4
#define DPI_MASK_ADR09_DLY_SEL                       ((u32)0x0000000F << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR08_DLY_SEL                      0
#define DPI_MASK_ADR08_DLY_SEL                       ((u32)0x0000000F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_DLY_2
 * @brief  ADR_DLY_2                                 (@ 0X108)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ALERT_DLY_SEL                      28
#define DPI_MASK_ALERT_DLY_SEL                       ((u32)0x0000000F << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TEN_DLY_SEL                        24
#define DPI_MASK_TEN_DLY_SEL                         ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR16_DLY_SEL                      20
#define DPI_MASK_ADR16_DLY_SEL                       ((u32)0x0000000F << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_BA2_DLY_SEL                        16
#define DPI_MASK_BA2_DLY_SEL                         ((u32)0x0000000F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_BA1_DLY_SEL                        12
#define DPI_MASK_BA1_DLY_SEL                         ((u32)0x0000000F << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_BA0_DLY_SEL                        8
#define DPI_MASK_BA0_DLY_SEL                         ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR5_EXT_DLY_SEL                   4
#define DPI_MASK_ADR5_EXT_DLY_SEL                    ((u32)0x0000000F << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR4_EXT_DLY_SEL                   0
#define DPI_MASK_ADR4_EXT_DLY_SEL                    ((u32)0x0000000F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CMD_DLY_0
 * @brief  CMD_DLY_0                                 (@ 0X10C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CS_N_1_DLY_SEL                     26
#define DPI_MASK_CS_N_1_DLY_SEL                      ((u32)0x0000000F << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_N_DLY_SEL                       20
#define DPI_MASK_CS_N_DLY_SEL                        ((u32)0x0000000F << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_DLY_SEL                        16
#define DPI_MASK_ODT_DLY_SEL                         ((u32)0x0000000F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_WE_N_DLY_SEL                       12
#define DPI_MASK_WE_N_DLY_SEL                        ((u32)0x0000000F << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAS_N_DLY_SEL                      8
#define DPI_MASK_CAS_N_DLY_SEL                       ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_RAS_N_DLY_SEL                      4
#define DPI_MASK_RAS_N_DLY_SEL                       ((u32)0x0000000F << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKE_DLY_SEL                        0
#define DPI_MASK_CKE_DLY_SEL                         ((u32)0x0000000F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CMD_DLY_1
 * @brief  CMD_DLY_1                                 (@ 0X110)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CKE_1_DLY_SEL                      28
#define DPI_MASK_CKE_1_DLY_SEL                       ((u32)0x0000000F << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DDR4_CS_N_DLY_SEL                  24
#define DPI_MASK_DDR4_CS_N_DLY_SEL                   ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ALERT_1_DLY_SEL                    20
#define DPI_MASK_ALERT_1_DLY_SEL                     ((u32)0x0000000F << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_PARITY_1_DLY_SEL                   16
#define DPI_MASK_PARITY_1_DLY_SEL                    ((u32)0x0000000F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_PARITY_DLY_SEL                     12
#define DPI_MASK_PARITY_DLY_SEL                      ((u32)0x0000000F << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DDR4_BG0_DLY_SEL                   8
#define DPI_MASK_DDR4_BG0_DLY_SEL                    ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DDR4_CKE_DLY_SEL                   4
#define DPI_MASK_DDR4_CKE_DLY_SEL                    ((u32)0x0000000F << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ACT_N_DLY_SEL                      0
#define DPI_MASK_ACT_N_DLY_SEL                       ((u32)0x0000000F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_OE_CTL
 * @brief  PAD_OE_CTL                                (@ 0X114)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR54_1TO1                         31
#define DPI_BIT_ADR54_1TO1                           ((u32)0x00000001 << 31)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCK_1_OE                           28
#define DPI_BIT_DCK_1_OE                             ((u32)0x00000001 << 28)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DCK_OE                             27
#define DPI_BIT_DCK_OE                               ((u32)0x00000001 << 27)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_CKE_OE                             26
#define DPI_BIT_CKE_OE                               ((u32)0x00000001 << 26)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_RAS_N_OE                           25
#define DPI_BIT_RAS_N_OE                             ((u32)0x00000001 << 25)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_CAS_N_OE                           24
#define DPI_BIT_CAS_N_OE                             ((u32)0x00000001 << 24)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_WE_N_OE                            23
#define DPI_BIT_WE_N_OE                              ((u32)0x00000001 << 23)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_ODT_OE                             22
#define DPI_BIT_ODT_OE                               ((u32)0x00000001 << 22)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_RESET_N_OE                         21
#define DPI_BIT_RESET_N_OE                           ((u32)0x00000001 << 21)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_BK2_OE                             20
#define DPI_BIT_BK2_OE                               ((u32)0x00000001 << 20)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_BK1_OE                             19
#define DPI_BIT_BK1_OE                               ((u32)0x00000001 << 19)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_BK0_OE                             18
#define DPI_BIT_BK0_OE                               ((u32)0x00000001 << 18)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_EXT_ADR5_OE                        17
#define DPI_BIT_EXT_ADR5_OE                          ((u32)0x00000001 << 17)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_EXT_ADR4_OE                        16
#define DPI_BIT_EXT_ADR4_OE                          ((u32)0x00000001 << 16)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR15_OE                           15
#define DPI_BIT_ADR15_OE                             ((u32)0x00000001 << 15)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR14_OE                           14
#define DPI_BIT_ADR14_OE                             ((u32)0x00000001 << 14)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR13_OE                           13
#define DPI_BIT_ADR13_OE                             ((u32)0x00000001 << 13)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR12_OE                           12
#define DPI_BIT_ADR12_OE                             ((u32)0x00000001 << 12)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR11_OE                           11
#define DPI_BIT_ADR11_OE                             ((u32)0x00000001 << 11)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR10_OE                           10
#define DPI_BIT_ADR10_OE                             ((u32)0x00000001 << 10)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR09_OE                           9
#define DPI_BIT_ADR09_OE                             ((u32)0x00000001 << 9)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR08_OE                           8
#define DPI_BIT_ADR08_OE                             ((u32)0x00000001 << 8)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR07_OE                           7
#define DPI_BIT_ADR07_OE                             ((u32)0x00000001 << 7)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR06_OE                           6
#define DPI_BIT_ADR06_OE                             ((u32)0x00000001 << 6)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR05_OE                           5
#define DPI_BIT_ADR05_OE                             ((u32)0x00000001 << 5)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR04_OE                           4
#define DPI_BIT_ADR04_OE                             ((u32)0x00000001 << 4)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR03_OE                           3
#define DPI_BIT_ADR03_OE                             ((u32)0x00000001 << 3)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR02_OE                           2
#define DPI_BIT_ADR02_OE                             ((u32)0x00000001 << 2)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR01_OE                           1
#define DPI_BIT_ADR01_OE                             ((u32)0x00000001 << 1)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR00_OE                           0
#define DPI_BIT_ADR00_OE                             ((u32)0x00000001 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_OE_CTL_EX
 * @brief  PAD_OE_CTL_EX                             (@ 0X118)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ODT_FORCE                          31
#define DPI_BIT_ODT_FORCE                            ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ACT_N_OE                           17
#define DPI_BIT_ACT_N_OE                             ((u32)0x00000001 << 17)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DDR4_TEN_OE                        16
#define DPI_BIT_DDR4_TEN_OE                          ((u32)0x00000001 << 16)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DDR4_ALERT0_OE                     15
#define DPI_BIT_DDR4_ALERT0_OE                       ((u32)0x00000001 << 15)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DDR4_ALERT1_OE                     14
#define DPI_BIT_DDR4_ALERT1_OE                       ((u32)0x00000001 << 14)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DDR4_CKE_OE                        13
#define DPI_BIT_DDR4_CKE_OE                          ((u32)0x00000001 << 13)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DDR4_BG0_OE                        12
#define DPI_BIT_DDR4_BG0_OE                          ((u32)0x00000001 << 12)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_PARITY_OE                          11
#define DPI_BIT_PARITY_OE                            ((u32)0x00000001 << 11)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_PARITY_1_OE                        10
#define DPI_BIT_PARITY_1_OE                          ((u32)0x00000001 << 10)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_ADR16_OE                           9
#define DPI_BIT_ADR16_OE                             ((u32)0x00000001 << 9)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_DDR4_CS_N_OE                       8
#define DPI_BIT_DDR4_CS_N_OE                         ((u32)0x00000001 << 8)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_CKE_1_OE                           2
#define DPI_BIT_CKE_1_OE                             ((u32)0x00000001 << 2)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_CS_N_1_OE                          1
#define DPI_BIT_CS_N_1_OE                            ((u32)0x00000001 << 1)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_CS_N_OE                            0
#define DPI_BIT_CS_N_OE                              ((u32)0x00000001 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_ALERT_SEL_0
 * @brief  PAD_ALERT_SEL_0                           (@ 0X11C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ALERT_SEL_0                        0
#define DPI_MASK_ALERT_SEL_0                         ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_ALERT_SEL_1
 * @brief  PAD_ALERT_SEL_1                           (@ 0X120)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ALERT_SEL_1                        0
#define DPI_MASK_ALERT_SEL_1                         ((u32)0x0000000F << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_ALERT1_SEL_0
 * @brief  PAD_ALERT1_SEL_0                          (@ 0X124)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ALERT_1_SEL_0                      0
#define DPI_MASK_ALERT_1_SEL_0                       ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0x80000000  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_ALERT1_SEL_1
 * @brief  PAD_ALERT1_SEL_1                          (@ 0X128)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ALERT_1_SEL_1                      0
#define DPI_MASK_ALERT_1_SEL_1                       ((u32)0x0000000F << 0)                              /*!<R/W 0  RSVD */
/** @} */

