Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup DPI_PAD_IDDQ
 * @brief  PAD_IDDQ                                  (@ 0X12C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_IDDQ                               0
#define DPI_MASK_IDDQ                                ((u32)0x00000FFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_CTRL_PROG
 * @brief  PAD_CTRL_PROG                             (@ 0X130)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZCTRL_FILTER_EN                    31
#define DPI_BIT_ZCTRL_FILTER_EN                      ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DZQ_UP_SEL                         28
#define DPI_MASK_DZQ_UP_SEL                          ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DZQ_AUTO_UP                        27
#define DPI_BIT_DZQ_AUTO_UP                          ((u32)0x00000001 << 27)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZCTRL_CLK_SEL                      25
#define DPI_MASK_ZCTRL_CLK_SEL                       ((u32)0x00000003 << 25)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_ZCTRL_START                        24
#define DPI_BIT_ZCTRL_START                          ((u32)0x00000001 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZCOMP_MODE                         23
#define DPI_BIT_ZCOMP_MODE                           ((u32)0x00000001 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZCTRL_MODE                         20
#define DPI_MASK_ZCTRL_MODE                          ((u32)0x00000007 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RZQ_EXT_R240                       19
#define DPI_BIT_RZQ_EXT_R240                         ((u32)0x00000001 << 19)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DZQ_REF_UP                         18
#define DPI_BIT_DZQ_REF_UP                           ((u32)0x00000001 << 18)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RZQ_COMP_INV                       17
#define DPI_BIT_RZQ_COMP_INV                         ((u32)0x00000001 << 17)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RZQ_CAL_EN                         16
#define DPI_BIT_RZQ_CAL_EN                           ((u32)0x00000001 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RVD                                15
#define DPI_BIT_RVD                                  ((u32)0x00000001 << 15)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZCTR_NCYC                          8
#define DPI_MASK_ZCTR_NCYC                           ((u32)0x0000007F << 8)                              /*!<R/W 0xC  RSVD */
#define DPI_SHIFT_ZQ_CAL_CMD                         7
#define DPI_BIT_ZQ_CAL_CMD                           ((u32)0x00000001 << 7)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZCTR_NCYC_LRG                      0
#define DPI_MASK_ZCTR_NCYC_LRG                       ((u32)0x0000007F << 0)                              /*!<R/W 0x19  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ZQ_NOCD2
 * @brief  ZQ_NOCD2                                  (@ 0X13C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZQ_OVWR_NOCD_DATA                  8
#define DPI_MASK_ZQ_OVWR_NOCD_DATA                   ((u32)0x0000003F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZQ_ENA_NOCD2                       0
#define DPI_BIT_ZQ_ENA_NOCD2                         ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_ZCTRL_STATUS
 * @brief  PAD_ZCTRL_STATUS                          (@ 0X140)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZCTRL_STATUS                       0
#define DPI_MASK_ZCTRL_STATUS                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_ZCTRL_RESULT
 * @brief  PAD_ZCTRL_RESULT                          (@ 0X144)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZCTRL_RESULT                       0
#define DPI_MASK_ZCTRL_RESULT                        ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_ZCTRL_RESULT_D
 * @brief  PAD_ZCTRL_RESULT_D                        (@ 0X148)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZCTRL_RESULT_DBG                   0
#define DPI_MASK_ZCTRL_RESULT_DBG                    ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_RZCTRL_STATUS
 * @brief  PAD_RZCTRL_STATUS                         (@ 0X14C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RZQ_480CODE                        1
#define DPI_MASK_RZQ_480CODE                         ((u32)0x0000001F << 1)                              /*!<R/W 0xF  RSVD */
#define DPI_SHIFT_RZQ_CAL_DONE                       0
#define DPI_BIT_RZQ_CAL_DONE                         ((u32)0x00000001 << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_DQS_CTRL
 * @brief  dq_dqs_ctrl                               (@ 0X150)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_TEN_EN                             24
#define DPI_BIT_TEN_EN                               ((u32)0x00000001 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_OE_SIG                         3
#define DPI_BIT_DQS_OE_SIG                           ((u32)0x00000001 << 3)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_DQ_LATCH_EN                        2
#define DPI_BIT_DQ_LATCH_EN                          ((u32)0x00000001 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TRIG_DQS                           1
#define DPI_BIT_TRIG_DQS                             ((u32)0x00000001 << 1)                              /*!<W 0  RSVD */
#define DPI_SHIFT_DQS_OE_FRC_EN                      0
#define DPI_BIT_DQS_OE_FRC_EN                        ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CMD_ADR_PH
 * @brief  CMD_ADDR_PH                               (@ 0X154)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CKE_1_PH_EN                        30
#define DPI_BIT_CKE_1_PH_EN                          ((u32)0x00000001 << 30)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKE_PH_EN                          29
#define DPI_BIT_CKE_PH_EN                            ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_1_PH_EN                         28
#define DPI_BIT_CS_1_PH_EN                           ((u32)0x00000001 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_PH_EN                           27
#define DPI_BIT_CS_PH_EN                             ((u32)0x00000001 << 27)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CMD_PH_EN                          26
#define DPI_BIT_CMD_PH_EN                            ((u32)0x00000001 << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKE_1_GEARDOWN                     24
#define DPI_BIT_CKE_1_GEARDOWN                       ((u32)0x00000001 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKE_GEARDOWN                       23
#define DPI_BIT_CKE_GEARDOWN                         ((u32)0x00000001 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_1_GEARDOWN                      22
#define DPI_BIT_CS_1_GEARDOWN                        ((u32)0x00000001 << 22)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_GEARDOWN                        21
#define DPI_BIT_CS_GEARDOWN                          ((u32)0x00000001 << 21)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CMD_GEARDOWN                       20
#define DPI_BIT_CMD_GEARDOWN                         ((u32)0x00000001 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKE_1_PH_SEL                       16
#define DPI_MASK_CKE_1_PH_SEL                        ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKE_PH_SEL                         12
#define DPI_MASK_CKE_PH_SEL                          ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_1_PH_SEL                        8
#define DPI_MASK_CS_1_PH_SEL                         ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_PH_SEL                          4
#define DPI_MASK_CS_PH_SEL                           ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CMD_PH_SEL                         0
#define DPI_MASK_CMD_PH_SEL                          ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_PAT_IN0
 * @brief  DQ_PAT_IN0                                (@ 0X158)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_PAT_IN                          0
#define DPI_MASK_DQ_PAT_IN0                           ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_PAT_IN1
 * @brief  DQ_PAT_IN1                                (@ 0X15C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_PAT_IN                          0
#define DPI_MASK_DQ_PAT_IN1                           ((u32)0x0000000F << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_WRLVL_DQS_DATA
 * @brief  WRLVL_DQS_DATA                            (@ 0X160)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_WRLVL_DQSDATA                      0
#define DPI_MASK_WRLVL_DQSDATA                       ((u32)0x000000FF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_TEST_CTRL0
 * @brief  TEST_CTRL0                                (@ 0X164)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_LBK_MODE                           30
#define DPI_MASK_LBK_MODE                            ((u32)0x00000003 << 30)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_LBK_SET                            29
#define DPI_BIT_LBK_SET                              ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DATA_EN_CHK                        28
#define DPI_BIT_DATA_EN_CHK                          ((u32)0x00000001 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TOP_DBG_SEL                        25
#define DPI_MASK_TOP_DBG_SEL                         ((u32)0x00000007 << 25)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RW_DBG_SEL0                        20
#define DPI_MASK_RW_DBG_SEL0                         ((u32)0x00000003 << 20)                             /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_TEST_CTRL1
 * @brief  TEST_CTRL1                                (@ 0X168)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DCC_DSP_DBG_SEL                    26
#define DPI_BIT_DCC_DSP_DBG_SEL                      ((u32)0x00000001 << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DBG_DLL_SEL                        24
#define DPI_BIT_DBG_DLL_SEL                          ((u32)0x00000001 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQSEN_DBG_SEL                      22
#define DPI_MASK_DQSEN_DBG_SEL                       ((u32)0x00000003 << 22)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RW_DBG_SEL1                        20
#define DPI_MASK_RW_DBG_SEL1                         ((u32)0x00000003 << 20)                             /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_HALF_CYC_DET
 * @brief  HAF_CYC_DET                               (@ 0X16C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DET_CLK_ENABLE                     15
#define DPI_BIT_DET_CLK_ENABLE                       ((u32)0x00000001 << 15)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DET_ENABLE                         14
#define DPI_BIT_DET_ENABLE                           ((u32)0x00000001 << 14)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DET_DONE                           13
#define DPI_BIT_DET_DONE                             ((u32)0x00000001 << 13)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DET_RESULT                         0
#define DPI_MASK_DET_RESULT                          ((u32)0x00001FFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_CTRL1
 * @brief  READ_CTRL1                                (@ 0X170)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RDDATA_EN_DLY_SEL                  28
#define DPI_MASK_RDDATA_EN_DLY_SEL                   ((u32)0x00000003 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_NCON_3T_MODE                       27
#define DPI_BIT_NCON_3T_MODE                         ((u32)0x00000001 << 27)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_NCON_2T_MODE                       26
#define DPI_BIT_NCON_2T_MODE                         ((u32)0x00000001 << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RD_DLY_FOLLOW_DQ0                  10
#define DPI_BIT_RD_DLY_FOLLOW_DQ0                    ((u32)0x00000001 << 10)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_LAT_EN_FORCE_SEL                9
#define DPI_BIT_DQ_LAT_EN_FORCE_SEL                  ((u32)0x00000001 << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_LAT_EN_FORCE_SIG                8
#define DPI_BIT_DQ_LAT_EN_FORCE_SIG                  ((u32)0x00000001 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_RD_FIFO                         0
#define DPI_MASK_TM_RD_FIFO                          ((u32)0x0000003F << 0)                              /*!<R/W 0x2  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_TX_RPT_CTRL
 * @brief  TX_RPT_CTRL                               (@ 0X174)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CKE_1_RPT_DEC                      27
#define DPI_BIT_CKE_1_RPT_DEC                        ((u32)0x00000001 << 27)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKE_1_RPT_ADD                      26
#define DPI_BIT_CKE_1_RPT_ADD                        ((u32)0x00000001 << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKE_RPT_DEC                        25
#define DPI_BIT_CKE_RPT_DEC                          ((u32)0x00000001 << 25)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKE_RPT_ADD                        24
#define DPI_BIT_CKE_RPT_ADD                          ((u32)0x00000001 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_1_RPT_DEC                       23
#define DPI_BIT_CS_1_RPT_DEC                         ((u32)0x00000001 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_1_RPT_ADD                       22
#define DPI_BIT_CS_1_RPT_ADD                         ((u32)0x00000001 << 22)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_RPT_DEC                         21
#define DPI_BIT_CS_RPT_DEC                           ((u32)0x00000001 << 21)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_RPT_ADD                         20
#define DPI_BIT_CS_RPT_ADD                           ((u32)0x00000001 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CA_RPT_DEC                         19
#define DPI_BIT_CA_RPT_DEC                           ((u32)0x00000001 << 19)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CA_RPT_ADD                         18
#define DPI_BIT_CA_RPT_ADD                           ((u32)0x00000001 << 18)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RX_RPT_DEC                         17
#define DPI_BIT_RX_RPT_DEC                           ((u32)0x00000001 << 17)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RX_RPT_ADD                         16
#define DPI_BIT_RX_RPT_ADD                           ((u32)0x00000001 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_RPT_DEC_3                      15
#define DPI_BIT_DQS_RPT_DEC_3                        ((u32)0x00000001 << 15)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_RPT_ADD_3                      14
#define DPI_BIT_DQS_RPT_ADD_3                        ((u32)0x00000001 << 14)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_RPT_DEC_2                      13
#define DPI_BIT_DQS_RPT_DEC_2                        ((u32)0x00000001 << 13)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_RPT_ADD_2                      12
#define DPI_BIT_DQS_RPT_ADD_2                        ((u32)0x00000001 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_RPT_DEC_1                      11
#define DPI_BIT_DQS_RPT_DEC_1                        ((u32)0x00000001 << 11)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_RPT_ADD_1                      10
#define DPI_BIT_DQS_RPT_ADD_1                        ((u32)0x00000001 << 10)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_RPT_DEC_0                      9
#define DPI_BIT_DQS_RPT_DEC_0                        ((u32)0x00000001 << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_RPT_ADD_0                      8
#define DPI_BIT_DQS_RPT_ADD_0                        ((u32)0x00000001 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_RPT_DEC_3                       7
#define DPI_BIT_DQ_RPT_DEC_3                         ((u32)0x00000001 << 7)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_RPT_ADD_3                       6
#define DPI_BIT_DQ_RPT_ADD_3                         ((u32)0x00000001 << 6)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_RPT_DEC_2                       5
#define DPI_BIT_DQ_RPT_DEC_2                         ((u32)0x00000001 << 5)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_RPT_ADD_2                       4
#define DPI_BIT_DQ_RPT_ADD_2                         ((u32)0x00000001 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_RPT_DEC_1                       3
#define DPI_BIT_DQ_RPT_DEC_1                         ((u32)0x00000001 << 3)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_RPT_ADD_1                       2
#define DPI_BIT_DQ_RPT_ADD_1                         ((u32)0x00000001 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_RPT_DEC_0                       1
#define DPI_BIT_DQ_RPT_DEC_0                         ((u32)0x00000001 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_RPT_ADD_0                       0
#define DPI_BIT_DQ_RPT_ADD_0                         ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CAL_SHIFT_CTRL
 * @brief  CAL_SHIFT_CTRL                            (@ 0X178)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CAL_LEAD3                          28
#define DPI_MASK_CAL_LEAD3                           ((u32)0x00000007 << 28)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_CAL_LEAD2                          24
#define DPI_MASK_CAL_LEAD2                           ((u32)0x00000007 << 24)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_CAL_LEAD1                          20
#define DPI_MASK_CAL_LEAD1                           ((u32)0x00000007 << 20)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_CAL_LEAD0                          16
#define DPI_MASK_CAL_LEAD0                           ((u32)0x00000007 << 16)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_CAL_LAG3                           12
#define DPI_MASK_CAL_LAG3                            ((u32)0x00000007 << 12)                             /*!<R/W 0x6  RSVD */
#define DPI_SHIFT_CAL_LAG2                           8
#define DPI_MASK_CAL_LAG2                            ((u32)0x00000007 << 8)                              /*!<R/W 0x6  RSVD */
#define DPI_SHIFT_CAL_LAG1                           4
#define DPI_MASK_CAL_LAG1                            ((u32)0x00000007 << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CAL_LAG0                           0
#define DPI_MASK_CAL_LAG0                            ((u32)0x00000007 << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

