Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup DPI_DT_SET0
 * @brief  DT_SET0                                   (@ 0X17C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DTN_CLK                            20
#define DPI_MASK_DTN_CLK                             ((u32)0x00000003 << 20)                             /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_DTP_CLK                            16
#define DPI_MASK_DTP_CLK                             ((u32)0x00000003 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DTN_DQS                            12
#define DPI_MASK_DTN_DQS                             ((u32)0x0000000F << 12)                             /*!<R/W 0xF  RSVD */
#define DPI_SHIFT_DTP_DQS                            8
#define DPI_MASK_DTP_DQS                             ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DTN_DQ                             4
#define DPI_MASK_DTN_DQ                              ((u32)0x0000000F << 4)                              /*!<R/W 0xF  RSVD */
#define DPI_SHIFT_DTP_DQ                             0
#define DPI_MASK_DTP_DQ                              ((u32)0x0000000F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ODT_TTCP0_SET0
 * @brief  ODT_TTCP0_SEL0                            (@ 0X180)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ODT_TTCP_SET_3_PRE                 24
#define DPI_MASK_ODT_TTCP_SET_3_PRE                  ((u32)0x0000003F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_2_PRE                 16
#define DPI_MASK_ODT_TTCP_SET_2_PRE                  ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_1_PRE                 8
#define DPI_MASK_ODT_TTCP_SET_1_PRE                  ((u32)0x0000003F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_0_PRE                 0
#define DPI_MASK_ODT_TTCP_SET_0_PRE                  ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ODT_TTCP1_SET0
 * @brief  ODT_TTCP1_SEL0                            (@ 0X184)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ODT_TTCP_SET_7_PRE                 24
#define DPI_MASK_ODT_TTCP_SET_7_PRE                  ((u32)0x0000003F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_6_PRE                 16
#define DPI_MASK_ODT_TTCP_SET_6_PRE                  ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_5_PRE                 8
#define DPI_MASK_ODT_TTCP_SET_5_PRE                  ((u32)0x0000003F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_4_PRE                 0
#define DPI_MASK_ODT_TTCP_SET_4_PRE                  ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ODT_TTCN0_SET0
 * @brief  ODT_TTCN0_SEL0                            (@ 0X188)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ODT_TTCN_SET_3_PRE                 24
#define DPI_MASK_ODT_TTCN_SET_3_PRE                  ((u32)0x0000003F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_2_PRE                 16
#define DPI_MASK_ODT_TTCN_SET_2_PRE                  ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_1_PRE                 8
#define DPI_MASK_ODT_TTCN_SET_1_PRE                  ((u32)0x0000003F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_0_PRE                 0
#define DPI_MASK_ODT_TTCN_SET_0_PRE                  ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ODT_TTCN1_SET0
 * @brief  ODT_TTCN1_SEL0                            (@ 0X18C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ODT_TTCN_SET_7_PRE                 24
#define DPI_MASK_ODT_TTCN_SET_7_PRE                  ((u32)0x0000003F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_6_PRE                 16
#define DPI_MASK_ODT_TTCN_SET_6_PRE                  ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_5_PRE                 8
#define DPI_MASK_ODT_TTCN_SET_5_PRE                  ((u32)0x0000003F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_4_PRE                 0
#define DPI_MASK_ODT_TTCN_SET_4_PRE                  ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCDP0_SET0
 * @brief  OCDP0_SET0                                (@ 0X190)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_OCDP_SET_3_PRE                     24
#define DPI_MASK_OCDP_SET_3_PRE                      ((u32)0x0000003F << 24)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_2_PRE                     16
#define DPI_MASK_OCDP_SET_2_PRE                      ((u32)0x0000003F << 16)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_1_PRE                     8
#define DPI_MASK_OCDP_SET_1_PRE                      ((u32)0x0000003F << 8)                              /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_0_PRE                     0
#define DPI_MASK_OCDP_SET_0_PRE                      ((u32)0x0000003F << 0)                              /*!<R/W 0x26  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCDP1_SET0
 * @brief  OCDP1_SET0                                (@ 0X194)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_OCDP_SET_7_PRE                     24
#define DPI_MASK_OCDP_SET_7_PRE                      ((u32)0x0000003F << 24)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_6_PRE                     16
#define DPI_MASK_OCDP_SET_6_PRE                      ((u32)0x0000003F << 16)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_5_PRE                     8
#define DPI_MASK_OCDP_SET_5_PRE                      ((u32)0x0000003F << 8)                              /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_4_PRE                     0
#define DPI_MASK_OCDP_SET_4_PRE                      ((u32)0x0000003F << 0)                              /*!<R/W 0x26  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCDN0_SET0
 * @brief  OCDN0_SET0                                (@ 0X198)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_OCDP_SET_7_PRE                     24
#define DPI_MASK_OCDP_SET_7_PRE                      ((u32)0x0000003F << 24)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_6_PRE                     16
#define DPI_MASK_OCDP_SET_6_PRE                      ((u32)0x0000003F << 16)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_5_PRE                     8
#define DPI_MASK_OCDP_SET_5_PRE                      ((u32)0x0000003F << 8)                              /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_4_PRE                     0
#define DPI_MASK_OCDP_SET_4_PRE                      ((u32)0x0000003F << 0)                              /*!<R/W 0x26  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCDN1_SET0
 * @brief  OCDN1_SET0                                (@ 0X19C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_OCDN_SET_7_PRE                     24
#define DPI_MASK_OCDN_SET_7_PRE                      ((u32)0x0000003F << 24)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDN_SET_6_PRE                     16
#define DPI_MASK_OCDN_SET_6_PRE                      ((u32)0x0000003F << 16)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDN_SET_5_PRE                     8
#define DPI_MASK_OCDN_SET_5_PRE                      ((u32)0x0000003F << 8)                              /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDN_SET_4_PRE                     0
#define DPI_MASK_OCDN_SET_4_PRE                      ((u32)0x0000003F << 0)                              /*!<R/W 0x26  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ODT_TTCP0_SET1
 * @brief  ODT_TTCP0_SEL1                            (@ 0X1A0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ODT_TTCP_SET_3                     24
#define DPI_MASK_ODT_TTCP_SET_3                      ((u32)0x0000003F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_2                     16
#define DPI_MASK_ODT_TTCP_SET_2                      ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_1                     8
#define DPI_MASK_ODT_TTCP_SET_1                      ((u32)0x0000003F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_0                     0
#define DPI_MASK_ODT_TTCP_SET_0                      ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ODT_TTCP1_SET1
 * @brief  ODT_TTCP1_SEL1                            (@ 0X1A4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ODT_TTCP_SET_7                     24
#define DPI_MASK_ODT_TTCP_SET_7                      ((u32)0x0000003F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_6                     16
#define DPI_MASK_ODT_TTCP_SET_6                      ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_5                     8
#define DPI_MASK_ODT_TTCP_SET_5                      ((u32)0x0000003F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCP_SET_4                     0
#define DPI_MASK_ODT_TTCP_SET_4                      ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ODT_TTCN0_SET1
 * @brief  ODT_TTCN0_SEL1                            (@ 0X1A8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ODT_TTCN_SET_3                     24
#define DPI_MASK_ODT_TTCN_SET_3                      ((u32)0x0000003F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_2                     16
#define DPI_MASK_ODT_TTCN_SET_2                      ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_1                     8
#define DPI_MASK_ODT_TTCN_SET_1                      ((u32)0x0000003F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_0                     0
#define DPI_MASK_ODT_TTCN_SET_0                      ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ODT_TTCN1_SET1
 * @brief  ODT_TTCN1_SEL1                            (@ 0X1AC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ODT_TTCN_SET_7                     24
#define DPI_MASK_ODT_TTCN_SET_7                      ((u32)0x0000003F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_6                     16
#define DPI_MASK_ODT_TTCN_SET_6                      ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_5                     8
#define DPI_MASK_ODT_TTCN_SET_5                      ((u32)0x0000003F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_TTCN_SET_4                     0
#define DPI_MASK_ODT_TTCN_SET_4                      ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCDP0_SET1
 * @brief  OCDP0_SET1                                (@ 0X1B0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_OCDP_SET_3                         24
#define DPI_MASK_OCDP_SET_3                          ((u32)0x0000003F << 24)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_2                         16
#define DPI_MASK_OCDP_SET_2                          ((u32)0x0000003F << 16)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_1                         8
#define DPI_MASK_OCDP_SET_1                          ((u32)0x0000003F << 8)                              /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_0                         0
#define DPI_MASK_OCDP_SET_0                          ((u32)0x0000003F << 0)                              /*!<R/W 0x26  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCDP1_SET1
 * @brief  OCDP1_SET1                                (@ 0X1B4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_OCDP_SET_7                         24
#define DPI_MASK_OCDP_SET_7                          ((u32)0x0000003F << 24)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_6                         16
#define DPI_MASK_OCDP_SET_6                          ((u32)0x0000003F << 16)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_5                         8
#define DPI_MASK_OCDP_SET_5                          ((u32)0x0000003F << 8)                              /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDP_SET_4                         0
#define DPI_MASK_OCDP_SET_4                          ((u32)0x0000003F << 0)                              /*!<R/W 0x26  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCDN0_SET1
 * @brief  OCDN0_SET1                                (@ 0X1B8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_OCDN_SET_3                         24
#define DPI_MASK_OCDN_SET_3                          ((u32)0x0000003F << 24)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDN_SET_2                         16
#define DPI_MASK_OCDN_SET_2                          ((u32)0x0000003F << 16)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDN_SET_1                         8
#define DPI_MASK_OCDN_SET_1                          ((u32)0x0000003F << 8)                              /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDN_SET_0                         0
#define DPI_MASK_OCDN_SET_0                          ((u32)0x0000003F << 0)                              /*!<R/W 0x26  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCDN1_SET1
 * @brief  OCDN1_SET1                                (@ 0X1BC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_OCDN_SET_7                         24
#define DPI_MASK_OCDN_SET_7                          ((u32)0x0000003F << 24)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDN_SET_6                         16
#define DPI_MASK_OCDN_SET_6                          ((u32)0x0000003F << 16)                             /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDN_SET_5                         8
#define DPI_MASK_OCDN_SET_5                          ((u32)0x0000003F << 8)                              /*!<R/W 0x26  RSVD */
#define DPI_SHIFT_OCDN_SET_4                         0
#define DPI_MASK_OCDN_SET_4                          ((u32)0x0000003F << 0)                              /*!<R/W 0x26  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_ODT_SEL_0
 * @brief  DQ_ODT_DEL_0                              (@ 0X1C0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_1_TTCN_SEL                      12
#define DPI_MASK_DQ_1_TTCN_SEL                       ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_0_TTCN_SEL                      8
#define DPI_MASK_DQ_0_TTCN_SEL                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_1_TTCP_SEL                      4
#define DPI_MASK_DQ_1_TTCP_SEL                       ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_0_TTCP_SEL                      0
#define DPI_MASK_DQ_0_TTCP_SEL                       ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_ODT_SEL_1
 * @brief  DQ_ODT_DEL_1                              (@ 0X1C4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_1_TTCN_SEL                      12
#define DPI_MASK_DQ_1_TTCN_SEL                       ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_0_TTCN_SEL                      8
#define DPI_MASK_DQ_0_TTCN_SEL                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_1_TTCP_SEL                      4
#define DPI_MASK_DQ_1_TTCP_SEL                       ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_0_TTCP_SEL                      0
#define DPI_MASK_DQ_0_TTCP_SEL                       ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_OCD_SEL_0
 * @brief  DQ_OCD_SEL_0                              (@ 0X1C8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_1_OCDN_SEL                      12
#define DPI_MASK_DQ_1_OCDN_SEL                       ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_0_OCDN_SEL                      8
#define DPI_MASK_DQ_0_OCDN_SEL                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_1_OCDP_SEL                      4
#define DPI_MASK_DQ_1_OCDP_SEL                       ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_0_OCDP_SEL                      0
#define DPI_MASK_DQ_0_OCDP_SEL                       ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_OCD_SEL_1
 * @brief  DQ_OCD_SEL_1                              (@ 0X1CC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_1_OCDN_SEL                      12
#define DPI_MASK_DQ_1_OCDN_SEL                       ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_0_OCDN_SEL                      8
#define DPI_MASK_DQ_0_OCDN_SEL                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_1_OCDP_SEL                      4
#define DPI_MASK_DQ_1_OCDP_SEL                       ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_0_OCDP_SEL                      0
#define DPI_MASK_DQ_0_OCDP_SEL                       ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_P_ODT_SEL_0
 * @brief  DQS_P_ODT_SEL_0                           (@ 0X1D0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_P_1_TTCN_SEL                   12
#define DPI_MASK_DQS_P_1_TTCN_SEL                    ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_0_TTCN_SEL                   8
#define DPI_MASK_DQS_P_0_TTCN_SEL                    ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_1_TTCP_SEL                   4
#define DPI_MASK_DQS_P_1_TTCP_SEL                    ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_0_TTCP_SEL                   0
#define DPI_MASK_DQS_P_0_TTCP_SEL                    ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_P_ODT_SEL_1
 * @brief  DQS_P_ODT_SEL_1                           (@ 0X1D4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_P_1_TTCN_SEL                   12
#define DPI_MASK_DQS_P_1_TTCN_SEL                    ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_0_TTCN_SEL                   8
#define DPI_MASK_DQS_P_0_TTCN_SEL                    ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_1_TTCP_SEL                   4
#define DPI_MASK_DQS_P_1_TTCP_SEL                    ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_0_TTCP_SEL                   0
#define DPI_MASK_DQS_P_0_TTCP_SEL                    ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

