Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup DPI_DQS_N_ODT_SEL_0
 * @brief  DQS_N_ODT_SEL_0                           (@ 0X1D8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_N_1_TTCN_SEL                   12
#define DPI_MASK_DQS_N_1_TTCN_SEL                    ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_0_TTCN_SEL                   8
#define DPI_MASK_DQS_N_0_TTCN_SEL                    ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_1_TTCP_SEL                   4
#define DPI_MASK_DQS_N_1_TTCP_SEL                    ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_0_TTCP_SEL                   0
#define DPI_MASK_DQS_N_0_TTCP_SEL                    ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_N_ODT_SEL_1
 * @brief  DQS_N_ODT_SEL_1                           (@ 0X1DC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_N_1_TTCN_SEL                   12
#define DPI_MASK_DQS_N_1_TTCN_SEL                    ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_0_TTCN_SEL                   8
#define DPI_MASK_DQS_N_0_TTCN_SEL                    ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_1_TTCP_SEL                   4
#define DPI_MASK_DQS_N_1_TTCP_SEL                    ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_0_TTCP_SEL                   0
#define DPI_MASK_DQS_N_0_TTCP_SEL                    ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_OCD_SEL_0
 * @brief  DQS_OCD_SEL_0                             (@ 0X1E0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_N_1_OCDN_SEL                   28
#define DPI_MASK_DQS_N_1_OCDN_SEL                    ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_0_OCDN_SEL                   24
#define DPI_MASK_DQS_N_0_OCDN_SEL                    ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_1_OCDP_SEL                   20
#define DPI_MASK_DQS_N_1_OCDP_SEL                    ((u32)0x00000007 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_0_OCDP_SEL                   16
#define DPI_MASK_DQS_N_0_OCDP_SEL                    ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_1_OCDN_SEL                   12
#define DPI_MASK_DQS_P_1_OCDN_SEL                    ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_0_OCDN_SEL                   8
#define DPI_MASK_DQS_P_0_OCDN_SEL                    ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_1_OCDP_SEL                   4
#define DPI_MASK_DQS_P_1_OCDP_SEL                    ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_0_OCDP_SEL                   0
#define DPI_MASK_DQS_P_0_OCDP_SEL                    ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_OCD_SEL_1
 * @brief  DQS_OCD_SEL_1                             (@ 0X1E4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_N_1_OCDN_SEL                   28
#define DPI_MASK_DQS_N_1_OCDN_SEL                    ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_0_OCDN_SEL                   24
#define DPI_MASK_DQS_N_0_OCDN_SEL                    ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_1_OCDP_SEL                   20
#define DPI_MASK_DQS_N_1_OCDP_SEL                    ((u32)0x00000007 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_N_0_OCDP_SEL                   16
#define DPI_MASK_DQS_N_0_OCDP_SEL                    ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_1_OCDN_SEL                   12
#define DPI_MASK_DQS_P_1_OCDN_SEL                    ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_0_OCDN_SEL                   8
#define DPI_MASK_DQS_P_0_OCDN_SEL                    ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_1_OCDP_SEL                   4
#define DPI_MASK_DQS_P_1_OCDP_SEL                    ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_P_0_OCDP_SEL                   0
#define DPI_MASK_DQS_P_0_OCDP_SEL                    ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CKE_OCD_SEL
 * @brief  CKE_OCD_SEL                               (@ 0X1E8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CKE_1_OCDN_SEL                     12
#define DPI_MASK_CKE_1_OCDN_SEL                      ((u32)0x00000007 << 12)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_CKE_1_OCDP_SEL                     8
#define DPI_MASK_CKE_1_OCDP_SEL                      ((u32)0x00000007 << 8)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_CKE_OCDN_SEL                       4
#define DPI_MASK_CKE_OCDN_SEL                        ((u32)0x00000007 << 4)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_CKE_OCDP_SEL                       0
#define DPI_MASK_CKE_OCDP_SEL                        ((u32)0x00000007 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_OCD_SEL
 * @brief  ADR_OCD_SEL                               (@ 0X1EC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CS_1_OCDN_SEL                      28
#define DPI_MASK_CS_1_OCDN_SEL                       ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_1_OCDP_SEL                      24
#define DPI_MASK_CS_1_OCDP_SEL                       ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_OCDN_SEL                        12
#define DPI_MASK_CS_OCDN_SEL                         ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_OCDP_SEL                        8
#define DPI_MASK_CS_OCDP_SEL                         ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CK_OCD_SEL
 * @brief  CK_OCD_SEL                                (@ 0X1F0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CK_N_1_OCDN_SEL                    28
#define DPI_MASK_CK_N_1_OCDN_SEL                     ((u32)0x00000007 << 28)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_CK_N_0_OCDN_SEL                    24
#define DPI_MASK_CK_N_0_OCDN_SEL                     ((u32)0x00000007 << 24)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_CK_N_1_OCDP_SEL                    20
#define DPI_MASK_CK_N_1_OCDP_SEL                     ((u32)0x00000007 << 20)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_CK_N_0_OCDP_SEL                    16
#define DPI_MASK_CK_N_0_OCDP_SEL                     ((u32)0x00000007 << 16)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_CK_P_1_OCDN_SEL                    12
#define DPI_MASK_CK_P_1_OCDN_SEL                     ((u32)0x00000007 << 12)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_CK_P_0_OCDN_SEL                    8
#define DPI_MASK_CK_P_0_OCDN_SEL                     ((u32)0x00000007 << 8)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_CK_P_1_OCDP_SEL                    4
#define DPI_MASK_CK_P_1_OCDP_SEL                     ((u32)0x00000007 << 4)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_CK_P_0_OCDP_SEL                    0
#define DPI_MASK_CK_P_0_OCDP_SEL                     ((u32)0x00000007 << 0)                              /*!<R/W 0x2  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_BUS_0
 * @brief  PAD_BUS_0                                 (@ 0X1F4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_EN_DCC                             31
#define DPI_BIT_EN_DCC                               ((u32)0x00000001 << 31)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_PD_CK                              30
#define DPI_BIT_PD_CK                                ((u32)0x00000001 << 30)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_EN_DMYI                            29
#define DPI_BIT_EN_DMYI                              ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_VREF_SEL                           28
#define DPI_BIT_VREF_SEL                             ((u32)0x00000001 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_VREF_RANGE                         27
#define DPI_BIT_VREF_RANGE                           ((u32)0x00000001 << 27)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_VREF_S                             21
#define DPI_MASK_VREF_S                              ((u32)0x0000003F << 21)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_VREF_CURRENTSEL                    19
#define DPI_MASK_VREF_CURRENTSEL                     ((u32)0x00000003 << 19)                             /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_VREF_PD                            18
#define DPI_BIT_VREF_PD                              ((u32)0x00000001 << 18)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_PAD_BUS_0                          0
#define DPI_MASK_PAD_BUS_0                           ((u32)0x0003FFFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_BUS_1
 * @brief  PAD_BUS_1                                 (@ 0X1F8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_PD_CK_1                            31
#define DPI_BIT_PD_CK_1                              ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_PAD_BUS_1                          0
#define DPI_MASK_PAD_BUS_1                           ((u32)0x0000007F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_BUS_2
 * @brief  PAD_BUS_2                                 (@ 0X1FC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_VREF_RANGE_2                       23
#define DPI_BIT_VREF_RANGE_2                         ((u32)0x00000001 << 23)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_VREF_S_2                           17
#define DPI_MASK_VREF_S_2                            ((u32)0x0000003F << 17)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_VREF_PD_2                          16
#define DPI_BIT_VREF_PD_2                            ((u32)0x00000001 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_VREF_RANGE_1                       15
#define DPI_BIT_VREF_RANGE_1                         ((u32)0x00000001 << 15)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_VREF_S_1                           9
#define DPI_MASK_VREF_S_1                            ((u32)0x0000003F << 9)                              /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_VREF_PD_1                          8
#define DPI_BIT_VREF_PD_1                            ((u32)0x00000001 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_VREF_RANGE_0                       7
#define DPI_BIT_VREF_RANGE_0                         ((u32)0x00000001 << 7)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_VREF_S_0                           1
#define DPI_MASK_VREF_S_0                            ((u32)0x0000003F << 1)                              /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_VREF_PD_0                          0
#define DPI_BIT_VREF_PD_0                            ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ZQ_TRIM
 * @brief  ZQ_TRIM                                   (@ 0X200)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_R480_TRIM                          0
#define DPI_BIT_R480_TRIM                            ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCD_SEL_0
 * @brief  OCD_SEL_0                                 (@ 0X204)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR00_OCDN_SEL                     28
#define DPI_MASK_ADR00_OCDN_SEL                      ((u32)0x00000007 << 28)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR00_OCDP_SEL                     24
#define DPI_MASK_ADR00_OCDP_SEL                      ((u32)0x00000007 << 24)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR01_OCDN_SEL                     20
#define DPI_MASK_ADR01_OCDN_SEL                      ((u32)0x00000007 << 20)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR01_OCDP_SEL                     16
#define DPI_MASK_ADR01_OCDP_SEL                      ((u32)0x00000007 << 16)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR02_OCDN_SEL                     12
#define DPI_MASK_ADR02_OCDN_SEL                      ((u32)0x00000007 << 12)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR02_OCDP_SEL                     8
#define DPI_MASK_ADR02_OCDP_SEL                      ((u32)0x00000007 << 8)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR03_OCDN_SEL                     4
#define DPI_MASK_ADR03_OCDN_SEL                      ((u32)0x00000007 << 4)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR03_OCDP_SEL                     0
#define DPI_MASK_ADR03_OCDP_SEL                      ((u32)0x00000007 << 0)                              /*!<R/W 0x1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCD_SEL_1
 * @brief  OCD_SEL_1                                 (@ 0X208)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR04_OCDN_SEL                     28
#define DPI_MASK_ADR04_OCDN_SEL                      ((u32)0x00000007 << 28)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR04_OCDP_SEL                     24
#define DPI_MASK_ADR04_OCDP_SEL                      ((u32)0x00000007 << 24)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR05_OCDN_SEL                     20
#define DPI_MASK_ADR05_OCDN_SEL                      ((u32)0x00000007 << 20)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR05_OCDP_SEL                     16
#define DPI_MASK_ADR05_OCDP_SEL                      ((u32)0x00000007 << 16)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR06_OCDN_SEL                     12
#define DPI_MASK_ADR06_OCDN_SEL                      ((u32)0x00000007 << 12)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR06_OCDP_SEL                     8
#define DPI_MASK_ADR06_OCDP_SEL                      ((u32)0x00000007 << 8)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR07_OCDN_SEL                     4
#define DPI_MASK_ADR07_OCDN_SEL                      ((u32)0x00000007 << 4)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR07_OCDP_SEL                     0
#define DPI_MASK_ADR07_OCDP_SEL                      ((u32)0x00000007 << 0)                              /*!<R/W 0x1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCD_SEL_2
 * @brief  OCD_SEL_2                                 (@ 0X20C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR08_OCDN_SEL                     28
#define DPI_MASK_ADR08_OCDN_SEL                      ((u32)0x00000007 << 28)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR08_OCDP_SEL                     24
#define DPI_MASK_ADR08_OCDP_SEL                      ((u32)0x00000007 << 24)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR09_OCDN_SEL                     20
#define DPI_MASK_ADR09_OCDN_SEL                      ((u32)0x00000007 << 20)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR09_OCDP_SEL                     16
#define DPI_MASK_ADR09_OCDP_SEL                      ((u32)0x00000007 << 16)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR10_OCDN_SEL                     12
#define DPI_MASK_ADR10_OCDN_SEL                      ((u32)0x00000007 << 12)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR10_OCDP_SEL                     8
#define DPI_MASK_ADR10_OCDP_SEL                      ((u32)0x00000007 << 8)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR11_OCDN_SEL                     4
#define DPI_MASK_ADR11_OCDN_SEL                      ((u32)0x00000007 << 4)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR11_OCDP_SEL                     0
#define DPI_MASK_ADR11_OCDP_SEL                      ((u32)0x00000007 << 0)                              /*!<R/W 0x1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCD_SEL_3
 * @brief  OCD_SEL_3                                 (@ 0X210)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR12_OCDN_SEL                     28
#define DPI_MASK_ADR12_OCDN_SEL                      ((u32)0x00000007 << 28)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR12_OCDP_SEL                     24
#define DPI_MASK_ADR12_OCDP_SEL                      ((u32)0x00000007 << 24)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR13_OCDN_SEL                     20
#define DPI_MASK_ADR13_OCDN_SEL                      ((u32)0x00000007 << 20)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR13_OCDP_SEL                     16
#define DPI_MASK_ADR13_OCDP_SEL                      ((u32)0x00000007 << 16)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR14_OCDN_SEL                     12
#define DPI_MASK_ADR14_OCDN_SEL                      ((u32)0x00000007 << 12)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR14_OCDP_SEL                     8
#define DPI_MASK_ADR14_OCDP_SEL                      ((u32)0x00000007 << 8)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR15_OCDN_SEL                     4
#define DPI_MASK_ADR15_OCDN_SEL                      ((u32)0x00000007 << 4)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR15_OCDP_SEL                     0
#define DPI_MASK_ADR15_OCDP_SEL                      ((u32)0x00000007 << 0)                              /*!<R/W 0x1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCD_SEL_4
 * @brief  OCD_SEL_4                                 (@ 0X214)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR16_OCDN_SEL                     28
#define DPI_MASK_ADR16_OCDN_SEL                      ((u32)0x00000007 << 28)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR16_OCDP_SEL                     24
#define DPI_MASK_ADR16_OCDP_SEL                      ((u32)0x00000007 << 24)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR_EXT_4_OCDN_SEL                 20
#define DPI_MASK_ADR_EXT_4_OCDN_SEL                  ((u32)0x00000007 << 20)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR_EXT_4_OCDP_SEL                 16
#define DPI_MASK_ADR_EXT_4_OCDP_SEL                  ((u32)0x00000007 << 16)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR_EXT_5_OCDN_SEL                 12
#define DPI_MASK_ADR_EXT_5_OCDN_SEL                  ((u32)0x00000007 << 12)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ADR_EXT_5_OCDP_SEL                 8
#define DPI_MASK_ADR_EXT_5_OCDP_SEL                  ((u32)0x00000007 << 8)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_BA0_OCDN_SEL                       4
#define DPI_MASK_BA0_OCDN_SEL                        ((u32)0x00000007 << 4)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_BA0_OCDP_SEL                       0
#define DPI_MASK_BA0_OCDP_SEL                        ((u32)0x00000007 << 0)                              /*!<R/W 0x1  RSVD */
/** @} */

