Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup DPI_OCD_SEL_5
 * @brief  OCD_SEL_5                                 (@ 0X218)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_BA1_OCDN_SEL                       28
#define DPI_MASK_BA1_OCDN_SEL                        ((u32)0x00000007 << 28)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_BA1_OCDP_SEL                       24
#define DPI_MASK_BA1_OCDP_SEL                        ((u32)0x00000007 << 24)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_BA2_OCDN_SEL                       20
#define DPI_MASK_BA2_OCDN_SEL                        ((u32)0x00000007 << 20)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_BA2_OCDP_SEL                       16
#define DPI_MASK_BA2_OCDP_SEL                        ((u32)0x00000007 << 16)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_RAS_OCDN_SEL                       12
#define DPI_MASK_RAS_OCDN_SEL                        ((u32)0x00000007 << 12)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_RAS_OCDP_SEL                       8
#define DPI_MASK_RAS_OCDP_SEL                        ((u32)0x00000007 << 8)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_CAS_OCDN_SEL                       4
#define DPI_MASK_CAS_OCDN_SEL                        ((u32)0x00000007 << 4)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_CAS_OCDP_SEL                       0
#define DPI_MASK_CAS_OCDP_SEL                        ((u32)0x00000007 << 0)                              /*!<R/W 0x1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCD_SEL_6
 * @brief  OCD_SEL_6                                 (@ 0X21C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_WE_OCDN_SEL                        28
#define DPI_MASK_WE_OCDN_SEL                         ((u32)0x00000007 << 28)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_WE_OCDP_SEL                        24
#define DPI_MASK_WE_OCDP_SEL                         ((u32)0x00000007 << 24)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ODT_OCDN_SEL                       20
#define DPI_MASK_ODT_OCDN_SEL                        ((u32)0x00000007 << 20)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ODT_OCDP_SEL                       16
#define DPI_MASK_ODT_OCDP_SEL                        ((u32)0x00000007 << 16)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_RST_OCDN_SEL                       12
#define DPI_MASK_RST_OCDN_SEL                        ((u32)0x00000007 << 12)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_RST_OCDP_SEL                       8
#define DPI_MASK_RST_OCDP_SEL                        ((u32)0x00000007 << 8)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_PAR_OCDN_SEL                       4
#define DPI_MASK_PAR_OCDN_SEL                        ((u32)0x00000007 << 4)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_PAR_OCDP_SEL                       0
#define DPI_MASK_PAR_OCDP_SEL                        ((u32)0x00000007 << 0)                              /*!<R/W 0x1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCD_SEL_7
 * @brief  OCD_SEL_7                                 (@ 0X220)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_PAR1_OCDN_SEL                      28
#define DPI_MASK_PAR1_OCDN_SEL                       ((u32)0x00000007 << 28)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_PAR1_OCDP_SEL                      24
#define DPI_MASK_PAR1_OCDP_SEL                       ((u32)0x00000007 << 24)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ACT_OCDN_SEL                       20
#define DPI_MASK_ACT_OCDN_SEL                        ((u32)0x00000007 << 20)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ACT_OCDP_SEL                       16
#define DPI_MASK_ACT_OCDP_SEL                        ((u32)0x00000007 << 16)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_DDR4_BG0_OCDN_SEL                  12
#define DPI_MASK_DDR4_BG0_OCDN_SEL                   ((u32)0x00000007 << 12)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_DDR4_BG0_OCDP_SEL                  8
#define DPI_MASK_DDR4_BG0_OCDP_SEL                   ((u32)0x00000007 << 8)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_TEN_OCDN_SEL                       4
#define DPI_MASK_TEN_OCDN_SEL                        ((u32)0x00000007 << 4)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_TEN_OCDP_SEL                       0
#define DPI_MASK_TEN_OCDP_SEL                        ((u32)0x00000007 << 0)                              /*!<R/W 0x1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_OCD_SEL_8
 * @brief  OCD_SEL_8                                 (@ 0X224)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ALERT_OCDN_SEL                     28
#define DPI_MASK_ALERT_OCDN_SEL                      ((u32)0x00000007 << 28)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ALERT_OCDP_SEL                     24
#define DPI_MASK_ALERT_OCDP_SEL                      ((u32)0x00000007 << 24)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ALERT1_OCDN_SEL                    20
#define DPI_MASK_ALERT1_OCDN_SEL                     ((u32)0x00000007 << 20)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_ALERT1_OCDP_SEL                    16
#define DPI_MASK_ALERT1_OCDP_SEL                     ((u32)0x00000007 << 16)                             /*!<R/W 0x1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ODT_SEL_0
 * @brief  ODT_SEL_0                                 (@ 0X228)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CA_TTCN_SEL                        4
#define DPI_MASK_CA_TTCN_SEL                         ((u32)0x00000007 << 4)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_CA_TTCP_SEL                        0
#define DPI_MASK_CA_TTCP_SEL                         ((u32)0x00000007 << 0)                              /*!<R/W 0x1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CKE_ODT_SEL
 * @brief  CKE_ODT_SEL                               (@ 0X22C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CKE_1_TTCN_SEL                     12
#define DPI_MASK_CKE_1_TTCN_SEL                      ((u32)0x00000007 << 12)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_CKE_1_TTCP_SEL                     8
#define DPI_MASK_CKE_1_TTCP_SEL                      ((u32)0x00000007 << 8)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_CKE_TTCN_SEL                       4
#define DPI_MASK_CKE_TTCN_SEL                        ((u32)0x00000007 << 4)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_CKE_TTCP_SEL                       0
#define DPI_MASK_CKE_TTCP_SEL                        ((u32)0x00000007 << 0)                              /*!<R/W 0x1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_ODT_SEL
 * @brief  ADR_ODT_SEL                               (@ 0X230)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CS_1_TTCN_SEL                      28
#define DPI_MASK_CS_1_TTCN_SEL                       ((u32)0x00000007 << 28)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_CS_1_TTCP_SEL                      24
#define DPI_MASK_CS_1_TTCP_SEL                       ((u32)0x00000007 << 24)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_CS_TTCN_SEL                        12
#define DPI_MASK_CS_TTCN_SEL                         ((u32)0x00000007 << 12)                             /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_CS_TTCP_SEL                        8
#define DPI_MASK_CS_TTCP_SEL                         ((u32)0x00000007 << 8)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_RST_TTCN_SEL                       4
#define DPI_MASK_RST_TTCN_SEL                        ((u32)0x00000007 << 4)                              /*!<R/W 0x1  RSVD */
#define DPI_SHIFT_RST_TTCP_SEL                       0
#define DPI_MASK_RST_TTCP_SEL                        ((u32)0x00000007 << 0)                              /*!<R/W 0x1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CLK_ODT_SEL
 * @brief  CLK_ODT_SEL                               (@ 0X234)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CK_1_TTCN_SEL                      12
#define DPI_MASK_CK_1_TTCN_SEL                       ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CK_1_TTCP_SEL                      8
#define DPI_MASK_CK_1_TTCP_SEL                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CK_TTCN_SEL                        4
#define DPI_MASK_CK_TTCN_SEL                         ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CK_TTCP_SEL                        0
#define DPI_MASK_CK_TTCP_SEL                         ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DPI_CTRL_0
 * @brief  DPI_CTRL_0                                (@ 0X238)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_EN_CRC                             29
#define DPI_BIT_EN_CRC                               ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_2T_WR_PRE                          28
#define DPI_BIT_2T_WR_PRE                            ((u32)0x00000001 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DATA_PRE                           21
#define DPI_BIT_DATA_PRE                             ((u32)0x00000001 << 21)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DATA_INIT                          20
#define DPI_BIT_DATA_INIT                            ((u32)0x00000001 << 20)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_CAL_DQSEN_UPDATE_ENA               19
#define DPI_BIT_CAL_DQSEN_UPDATE_ENA                 ((u32)0x00000001 << 19)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_CAL_DQSEN_MODE                     17
#define DPI_MASK_CAL_DQSEN_MODE                      ((u32)0x00000003 << 17)                             /*!<R/W 0x3  RSVD */
#define DPI_SHIFT_2T_RD_PRE                          15
#define DPI_BIT_2T_RD_PRE                            ((u32)0x00000001 << 15)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_REF_CMD_SEL                        14
#define DPI_BIT_REF_CMD_SEL                          ((u32)0x00000001 << 14)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_REF_UPDATE_DLY                     8
#define DPI_MASK_REF_UPDATE_DLY                      ((u32)0x0000003F << 8)                              /*!<R/W 0x20  RSVD */
#define DPI_SHIFT_CAL_SET_MODE                       4
#define DPI_MASK_CAL_SET_MODE                        ((u32)0x00000003 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_RST_FIFO_MODE                      2
#define DPI_MASK_RST_FIFO_MODE                       ((u32)0x00000003 << 2)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_FW_SET_MODE                        0
#define DPI_MASK_FW_SET_MODE                         ((u32)0x00000003 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DPI_CTRL_1
 * @brief  DPI_CTRL_1                                (@ 0X23C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_WRITE_EN_MSB                         31
#define DPI_BIT_WRITE_EN_MSB                           ((u32)0x00000001 << 31)                             /*!<W 0  RSVD */
#define DPI_SHIFT_SET_REG_VALID                      30
#define DPI_BIT_SET_REG_VALID                        ((u32)0x00000001 << 30)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_3                         7
#define DPI_BIT_WRITE_EN_3                           ((u32)0x00000001 << 7)                              /*!<W 0  RSVD */
#define DPI_SHIFT_FW_SET_RD_DET                      6
#define DPI_BIT_FW_SET_RD_DET                        ((u32)0x00000001 << 6)                              /*!<W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_2                         5
#define DPI_BIT_WRITE_EN_2                           ((u32)0x00000001 << 5)                              /*!<W 0  RSVD */
#define DPI_SHIFT_FW_SET_CAL_RANGE                   4
#define DPI_BIT_FW_SET_CAL_RANGE                     ((u32)0x00000001 << 4)                              /*!<W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_1                         3
#define DPI_BIT_WRITE_EN_1                           ((u32)0x00000001 << 3)                              /*!<W 0  RSVD */
#define DPI_SHIFT_FW_SET_RD_DLY                      2
#define DPI_BIT_FW_SET_RD_DLY                        ((u32)0x00000001 << 2)                              /*!<W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_0                         1
#define DPI_BIT_WRITE_EN_0                           ((u32)0x00000001 << 1)                              /*!<W 0  RSVD */
#define DPI_SHIFT_FW_SET_WR_DLY                      0
#define DPI_BIT_FW_SET_WR_DLY                        ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DPI_CTRL_2
 * @brief  DPI_CTRL_2                                (@ 0X240)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RST_DQSEN_CAL                      31
#define DPI_BIT_RST_DQSEN_CAL                        ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_SET_REG_VALID_MODE                 28
#define DPI_BIT_SET_REG_VALID_MODE                   ((u32)0x00000001 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RST_3POINT_MODE                    26
#define DPI_MASK_RST_3POINT_MODE                     ((u32)0x00000003 << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RST_DQSEN_MODE                     24
#define DPI_MASK_RST_DQSEN_MODE                      ((u32)0x00000003 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ALERT_ENA                          23
#define DPI_BIT_ALERT_ENA                            ((u32)0x00000001 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ALERT_1_ENA                        22
#define DPI_BIT_ALERT_1_ENA                          ((u32)0x00000001 << 22)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RD_UPDATE_DLY                      16
#define DPI_MASK_RD_UPDATE_DLY                       ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RD_UPDATE_DLY_RX                   8
#define DPI_MASK_RD_UPDATE_DLY_RX                    ((u32)0x0000001F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_PWROFF_CMD_GATE                    4
#define DPI_MASK_PWROFF_CMD_GATE                     ((u32)0x0000000F << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_DELAY_SEL                       1
#define DPI_MASK_CS_DELAY_SEL                        ((u32)0x00000007 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_DELAY_EN                        0
#define DPI_BIT_CS_DELAY_EN                          ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_INT_CTRL
 * @brief  INT_CTRL                                (@ 0X254)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_WRITE_EN_14                        29
#define DPI_BIT_WRITE_EN_14                          ((u32)0x00000001 << 29)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_INT_DQS_BURST_ERR_EN               28
#define DPI_BIT_INT_DQS_BURST_ERR_EN                 ((u32)0x00000001 << 28)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_13                        27
#define DPI_BIT_WRITE_EN_13                          ((u32)0x00000001 << 27)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_INT_TM_DQSEN_EN                    26
#define DPI_BIT_INT_TM_DQSEN_EN                      ((u32)0x00000001 << 26)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_12                        25
#define DPI_BIT_WRITE_EN_12                          ((u32)0x00000001 << 25)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_INT_FIFO_PTR_EN                    24
#define DPI_BIT_INT_FIFO_PTR_EN                      ((u32)0x00000001 << 24)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_11                        23
#define DPI_BIT_WRITE_EN_11                          ((u32)0x00000001 << 23)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_INT_ZQ_EN                          22
#define DPI_BIT_INT_ZQ_EN                            ((u32)0x00000001 << 22)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_8                         17
#define DPI_BIT_WRITE_EN_8                           ((u32)0x00000001 << 17)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_INT_ALERT_EN                       16
#define DPI_BIT_INT_ALERT_EN                         ((u32)0x00000001 << 16)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_7                         15
#define DPI_BIT_WRITE_EN_7                           ((u32)0x00000001 << 15)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_INT_PLL_EN                         14
#define DPI_BIT_INT_PLL_EN                           ((u32)0x00000001 << 14)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_6                         13
#define DPI_BIT_WRITE_EN_6                           ((u32)0x00000001 << 13)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_INT_CPU_3_EN                       12
#define DPI_BIT_INT_CPU_3_EN                         ((u32)0x00000001 << 12)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_5                         11
#define DPI_BIT_WRITE_EN_5                           ((u32)0x00000001 << 11)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_INT_CPU_2_EN                       10
#define DPI_BIT_INT_CPU_2_EN                         ((u32)0x00000001 << 10)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_4                         9
#define DPI_BIT_WRITE_EN_4                           ((u32)0x00000001 << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_INT_CPU_1_EN                       8
#define DPI_BIT_INT_CPU_1_EN                         ((u32)0x00000001 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_3                         7
#define DPI_BIT_WRITE_EN_3                           ((u32)0x00000001 << 7)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_INT_CPU_0_EN                       6
#define DPI_BIT_INT_CPU_0_EN                         ((u32)0x00000001 << 6)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_2                         5
#define DPI_BIT_WRITE_EN_2                           ((u32)0x00000001 << 5)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_FW_CLR_DQS_INT                     4
#define DPI_BIT_FW_CLR_DQS_INT                       ((u32)0x00000001 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_1                         3
#define DPI_BIT_WRITE_EN_1                           ((u32)0x00000001 << 3)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_INT_CAL_BDY_EN                     2
#define DPI_BIT_INT_CAL_BDY_EN                       ((u32)0x00000001 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_WRITE_EN_0                         1
#define DPI_BIT_WRITE_EN_0                           ((u32)0x00000001 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_EN                             0
#define DPI_BIT_DQS_EN                               ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

