Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup DPI_INT_STATUS_0
 * @brief  INT_STATUS_0                                (@ 0X258)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_BURST_ERR_INT_3                15
#define DPI_BIT_DQS_BURST_ERR_INT_3                  ((u32)0x00000001 << 15)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_BURST_ERR_INT_2                14
#define DPI_BIT_DQS_BURST_ERR_INT_2                  ((u32)0x00000001 << 14)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_BURST_ERR_INT_1                13
#define DPI_BIT_DQS_BURST_ERR_INT_1                  ((u32)0x00000001 << 13)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_BURST_ERR_INT_0                12
#define DPI_BIT_DQS_BURST_ERR_INT_0                  ((u32)0x00000001 << 12)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQSEN_EARLY_INT_3               11
#define DPI_BIT_TM_DQSEN_EARLY_INT_3                 ((u32)0x00000001 << 11)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQSEN_EARLY_INT_2               10
#define DPI_BIT_TM_DQSEN_EARLY_INT_2                 ((u32)0x00000001 << 10)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQSEN_EARLY_INT_1               9
#define DPI_BIT_TM_DQSEN_EARLY_INT_1                 ((u32)0x00000001 << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQSEN_EARLY_INT_0               8
#define DPI_BIT_TM_DQSEN_EARLY_INT_0                 ((u32)0x00000001 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQSEN_LATE_INT_3                7
#define DPI_BIT_TM_DQSEN_LATE_INT_3                  ((u32)0x00000001 << 7)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQSEN_LATE_INT_2                6
#define DPI_BIT_TM_DQSEN_LATE_INT_2                  ((u32)0x00000001 << 6)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQSEN_LATE_INT_1                5
#define DPI_BIT_TM_DQSEN_LATE_INT_1                  ((u32)0x00000001 << 5)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQSEN_LATE_INT_0                4
#define DPI_BIT_TM_DQSEN_LATE_INT_0                  ((u32)0x00000001 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_INT_3                          3
#define DPI_BIT_DQS_INT_3                            ((u32)0x00000001 << 3)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_INT_2                          2
#define DPI_BIT_DQS_INT_2                            ((u32)0x00000001 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_INT_1                          1
#define DPI_BIT_DQS_INT_1                            ((u32)0x00000001 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_INT_0                          0
#define DPI_BIT_DQS_INT_0                            ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CS_EMPH_CTRL
 * @brief  CS_EMPH_CTRL                              (@ 0X298)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CS1_SLEWRATE                       29
#define DPI_BIT_CS1_SLEWRATE                         ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS1_DLY_EMPH                       24
#define DPI_MASK_CS1_DLY_EMPH                        ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS1_EN_EMPHN                       20
#define DPI_MASK_CS1_EN_EMPHN                        ((u32)0x0000000F << 20)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CS1_EN_EMPHP                       16
#define DPI_MASK_CS1_EN_EMPHP                        ((u32)0x0000000F << 16)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CS_SLEWRATE                        12
#define DPI_MASK_CS_SLEWRATE                         ((u32)0x00000003 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_DLY_EMPH                        8
#define DPI_MASK_CS_DLY_EMPH                         ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CS_EN_EMPHN                        4
#define DPI_MASK_CS_EN_EMPHN                         ((u32)0x0000000F << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CS_EN_EMPHP                        0
#define DPI_MASK_CS_EN_EMPHP                         ((u32)0x0000000F << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CS_SEL_EMPH_CTL
 * @brief  CS_SEL_EMPH_CTL                           (@ 0X29C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CS1_SEL_EMPHN                      20
#define DPI_MASK_CS1_SEL_EMPHN                       ((u32)0x0000000F << 20)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CS1_SEL_EMPHP                      16
#define DPI_MASK_CS1_SEL_EMPHP                       ((u32)0x0000000F << 16)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CS_SEL_EMPHN                       4
#define DPI_MASK_CS_SEL_EMPHN                        ((u32)0x0000000F << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CS_SEL_EMPHP                       0
#define DPI_MASK_CS_SEL_EMPHP                        ((u32)0x0000000F << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DDR4_CS_EMPH_CTL
 * @brief  DDR4_CS_EMPH_CTL                          (@ 0X2A0)
 * @{
 *****************************************************************************/
#define DPI_DDR4_SHIFT_CS_SEL_EMPHN                       20
#define DPI_DDR4_MASK_CS_SEL_EMPHN                        ((u32)0x0000000F << 20)                             /*!<R/W 0x7  RSVD */
#define DPI_DDR4_SHIFT_CS_SEL_EMPHP                       16
#define DPI_DDR4_MASK_CS_SEL_EMPHP                        ((u32)0x0000000F << 16)                             /*!<R/W 0x7  RSVD */
#define DPI_DDR4_SHIFT_CS_SLEWRATE                        12
#define DPI_DDR4_MASK_CS_SLEWRATE                         ((u32)0x00000003 << 12)                             /*!<R/W 0  RSVD */
#define DPI_DDR4_SHIFT_CS_DLY_EMPH                        8
#define DPI_DDR4_MASK_CS_DLY_EMPH                         ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_DDR4_SHIFT_CS_EN_EMPHN                        4
#define DPI_DDR4_MASK_CS_EN_EMPHN                         ((u32)0x0000000F << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_DDR4_SHIFT_CS_EN_EMPHP                        0
#define DPI_DDR4_MASK_CS_EN_EMPHP                         ((u32)0x0000000F << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CK_EMPH_CTL
 * @brief  CK_EMPH_CTL                               (@ 0X2A4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CK1_SLEWRATE                       29
#define DPI_BIT_CK1_SLEWRATE                         ((u32)0x00000001 << 29)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CK1_DLY_EMPH                       24
#define DPI_MASK_CK1_DLY_EMPH                        ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CK1_EN_EMPHN                       20
#define DPI_MASK_CK1_EN_EMPHN                        ((u32)0x0000000F << 20)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CK1_EN_EMPHP                       16
#define DPI_MASK_CK1_EN_EMPHP                        ((u32)0x0000000F << 16)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CK_SLEWRATE                        12
#define DPI_MASK_CK_SLEWRATE                         ((u32)0x00000003 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CK_DLY_EMPH                        8
#define DPI_MASK_CK_DLY_EMPH                         ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CK_EN_EMPHN                        4
#define DPI_MASK_CK_EN_EMPHN                         ((u32)0x0000000F << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CK_EN_EMPHP                        0
#define DPI_MASK_CK_EN_EMPHP                         ((u32)0x0000000F << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CK_SEL_EMPH_CTL
 * @brief  CK_SEL_EMPH_CTL                           (@ 0X2A8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CK1_SEL_EMPHN                      20
#define DPI_MASK_CK1_SEL_EMPHN                       ((u32)0x0000000F << 20)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CK1_SEL_EMPHP                      16
#define DPI_MASK_CK1_SEL_EMPHP                       ((u32)0x0000000F << 16)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CK_SEL_EMPHN                       4
#define DPI_MASK_CK_SEL_EMPHN                        ((u32)0x0000000F << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_CK_SEL_EMPHP                       0
#define DPI_MASK_CK_SEL_EMPHP                        ((u32)0x0000000F << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_EMPH_CTL_0
 * @brief  ADR_EMPH_CTL_0                            (@ 0X2AC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR_SLEWRATE_1                     28
#define DPI_MASK_ADR_SLEWRATE_1                      ((u32)0x00000003 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR_DLY_EMPH_1                     24
#define DPI_MASK_ADR_DLY_EMPH_1                      ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR_EN_EMPHN_1                     20
#define DPI_MASK_ADR_EN_EMPHN_1                      ((u32)0x0000000F << 20)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_EN_EMPHP_1                     16
#define DPI_MASK_ADR_EN_EMPHP_1                      ((u32)0x0000000F << 16)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_SLEWRATE_0                     12
#define DPI_MASK_ADR_SLEWRATE_0                      ((u32)0x00000003 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR_DLY_EMPH_0                     8
#define DPI_MASK_ADR_DLY_EMPH_0                      ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR_EN_EMPHN_0                     4
#define DPI_MASK_ADR_EN_EMPHN_0                      ((u32)0x0000000F << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_EN_EMPHP_0                     0
#define DPI_MASK_ADR_EN_EMPHP_0                      ((u32)0x0000000F << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_EMPH_CTL_1
 * @brief  ADR_EMPH_CTL_1                            (@ 0X2B0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR_SLEWRATE_1                     28
#define DPI_MASK_ADR_SLEWRATE_1                      ((u32)0x00000003 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR_DLY_EMPH_1                     24
#define DPI_MASK_ADR_DLY_EMPH_1                      ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR_EN_EMPHN_1                     20
#define DPI_MASK_ADR_EN_EMPHN_1                      ((u32)0x0000000F << 20)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_EN_EMPHP_1                     16
#define DPI_MASK_ADR_EN_EMPHP_1                      ((u32)0x0000000F << 16)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_SLEWRATE_0                     12
#define DPI_MASK_ADR_SLEWRATE_0                      ((u32)0x00000003 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR_DLY_EMPH_0                     8
#define DPI_MASK_ADR_DLY_EMPH_0                      ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ADR_EN_EMPHN_0                     4
#define DPI_MASK_ADR_EN_EMPHN_0                      ((u32)0x0000000F << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_EN_EMPHP_0                     0
#define DPI_MASK_ADR_EN_EMPHP_0                      ((u32)0x0000000F << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_SEL_EMPH_CTL_0
 * @brief  ADR_SEL_EMPH_CTL_0                        (@ 0X2B4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR_SEL_EMPHN_1                    20
#define DPI_MASK_ADR_SEL_EMPHN_1                     ((u32)0x0000000F << 20)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_SEL_EMPHP_1                    16
#define DPI_MASK_ADR_SEL_EMPHP_1                     ((u32)0x0000000F << 16)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_SEL_EMPHN_0                    4
#define DPI_MASK_ADR_SEL_EMPHN_0                     ((u32)0x0000000F << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_SEL_EMPHP_0                    0
#define DPI_MASK_ADR_SEL_EMPHP_0                     ((u32)0x0000000F << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_SEL_EMPH_CTL_1
 * @brief  ADR_SEL_EMPH_CTL_1                        (@ 0X2B8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ADR_SEL_EMPHN_1                    20
#define DPI_MASK_ADR_SEL_EMPHN_1                     ((u32)0x0000000F << 20)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_SEL_EMPHP_1                    16
#define DPI_MASK_ADR_SEL_EMPHP_1                     ((u32)0x0000000F << 16)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_SEL_EMPHN_0                    4
#define DPI_MASK_ADR_SEL_EMPHN_0                     ((u32)0x0000000F << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_ADR_SEL_EMPHP_0                    0
#define DPI_MASK_ADR_SEL_EMPHP_0                     ((u32)0x0000000F << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_EMPH_SEL_0
 * @brief  ADR_EMPH_SEL_0                            (@ 0X2BC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_A15_EMPH_SEL                       30
#define DPI_MASK_A15_EMPH_SEL                        ((u32)0x00000003 << 30)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_A14_EMPH_SEL                       28
#define DPI_MASK_A14_EMPH_SEL                        ((u32)0x00000003 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_A13_EMPH_SEL                       26
#define DPI_MASK_A13_EMPH_SEL                        ((u32)0x00000003 << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_A12_EMPH_SEL                       24
#define DPI_MASK_A12_EMPH_SEL                        ((u32)0x00000003 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_A11_EMPH_SEL                       22
#define DPI_MASK_A11_EMPH_SEL                        ((u32)0x00000003 << 22)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_A10_EMPH_SEL                       20
#define DPI_MASK_A10_EMPH_SEL                        ((u32)0x00000003 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_A9_EMPH_SEL                        18
#define DPI_MASK_A9_EMPH_SEL                         ((u32)0x00000003 << 18)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_A8_EMPH_SEL                        16
#define DPI_MASK_A8_EMPH_SEL                         ((u32)0x00000003 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_A7_EMPH_SEL                        14
#define DPI_MASK_A7_EMPH_SEL                         ((u32)0x00000003 << 14)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_A6_EMPH_SEL                        12
#define DPI_MASK_A6_EMPH_SEL                         ((u32)0x00000003 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_A5_EMPH_SEL                        10
#define DPI_MASK_A5_EMPH_SEL                         ((u32)0x00000003 << 10)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_A4_EMPH_SEL                        8
#define DPI_MASK_A4_EMPH_SEL                         ((u32)0x00000003 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_A3_EMPH_SEL                        6
#define DPI_MASK_A3_EMPH_SEL                         ((u32)0x00000003 << 6)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_A2_EMPH_SEL                        4
#define DPI_MASK_A2_EMPH_SEL                         ((u32)0x00000003 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_A1_EMPH_SEL                        2
#define DPI_MASK_A1_EMPH_SEL                         ((u32)0x00000003 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_A0_EMPH_SEL                        0
#define DPI_MASK_A0_EMPH_SEL                         ((u32)0x00000003 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_EMPH_SEL_1
 * @brief  ADR_EMPH_SEL_1                            (@ 0X2C0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ACT_EMPH_SEL                       30
#define DPI_MASK_ACT_EMPH_SEL                        ((u32)0x00000003 << 30)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RST_EMPH_SEL                       28
#define DPI_MASK_RST_EMPH_SEL                        ((u32)0x00000003 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_WE_EMPH_SEL                        26
#define DPI_MASK_WE_EMPH_SEL                         ((u32)0x00000003 << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RAS_EMPH_SEL                       24
#define DPI_MASK_RAS_EMPH_SEL                        ((u32)0x00000003 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_PAR1_EMPH_SEL                      22
#define DPI_MASK_PAR1_EMPH_SEL                       ((u32)0x00000003 << 22)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_PAR_EMPH_SEL                       20
#define DPI_MASK_PAR_EMPH_SEL                        ((u32)0x00000003 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_EMPH_SEL                       18
#define DPI_MASK_ODT_EMPH_SEL                        ((u32)0x00000003 << 18)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKE1_EMPH_SEL                      16
#define DPI_MASK_CKE1_EMPH_SEL                       ((u32)0x00000003 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CKE_EMPH_SEL                       14
#define DPI_MASK_CKE_EMPH_SEL                        ((u32)0x00000003 << 14)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAS_EMPH_SEL                       12
#define DPI_MASK_CAS_EMPH_SEL                        ((u32)0x00000003 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_BA2_EMPH_SEL                       10
#define DPI_MASK_BA2_EMPH_SEL                        ((u32)0x00000003 << 10)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_BA1_EMPH_SEL                       8
#define DPI_MASK_BA1_EMPH_SEL                        ((u32)0x00000003 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_BA0_EMPH_SEL                       6
#define DPI_MASK_BA0_EMPH_SEL                        ((u32)0x00000003 << 6)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_AD1_5_EMPH_SEL                     4
#define DPI_MASK_AD1_5_EMPH_SEL                      ((u32)0x00000003 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_AD1_4_EMPH_SEL                     2
#define DPI_MASK_AD1_4_EMPH_SEL                      ((u32)0x00000003 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_A16_EMPH_SEL                       0
#define DPI_MASK_A16_EMPH_SEL                        ((u32)0x00000003 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_ADR_EMPH_SEL_2
 * @brief  ADR_EMPH_SEL_2                            (@ 0X2C4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ALERT1_EMPH_SEL                    8
#define DPI_MASK_ALERT1_EMPH_SEL                     ((u32)0x00000003 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ALERT_EMPH_SEL                     6
#define DPI_MASK_ALERT_EMPH_SEL                      ((u32)0x00000003 << 6)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DDR4_TEN_EMPH_SEL                  4
#define DPI_MASK_DDR4_TEN_EMPH_SEL                   ((u32)0x00000003 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DDR4_CKE_EMPH_SEL                  2
#define DPI_MASK_DDR4_CKE_EMPH_SEL                   ((u32)0x00000003 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DDR4_BG0_EMPH_SEL                  0
#define DPI_MASK_DDR4_BG0_EMPH_SEL                   ((u32)0x00000003 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_CTRL_ZPROG
 * @brief  PAD_CTRL_ZPROG                            (@ 0X2E8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZPROG_3                            24
#define DPI_MASK_ZPROG_3                             ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_2                            16
#define DPI_MASK_ZPROG_2                             ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_1                            8
#define DPI_MASK_ZPROG_1                             ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_0                            0
#define DPI_MASK_ZPROG_0                             ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

