Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup DPI_PAD_CTRL_ZPROG_1
 * @brief  PAD_CTRL_ZPROG_1                          (@ 0X2EC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZPROG_3                            24
#define DPI_MASK_ZPROG_3                             ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_2                            16
#define DPI_MASK_ZPROG_2                             ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_1                            8
#define DPI_MASK_ZPROG_1                             ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_0                            0
#define DPI_MASK_ZPROG_0                             ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_CTRL_ZPROG_2
 * @brief  PAD_CTRL_ZPROG_2                          (@ 0X2F0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZPROG_3                            24
#define DPI_MASK_ZPROG_3                             ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_2                            16
#define DPI_MASK_ZPROG_2                             ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_1                            8
#define DPI_MASK_ZPROG_1                             ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_0                            0
#define DPI_MASK_ZPROG_0                             ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_CTRL_ZPROG_3
 * @brief  PAD_CTRL_ZPROG_3                          (@ 0X2F4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZPROG_3                            24
#define DPI_MASK_ZPROG_3                             ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_2                            16
#define DPI_MASK_ZPROG_2                             ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_1                            8
#define DPI_MASK_ZPROG_1                             ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_0                            0
#define DPI_MASK_ZPROG_0                             ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_CTRL_ZPROG_4
 * @brief  PAD_CTRL_ZPROG_4                          (@ 0X2F8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZPROG_3                            24
#define DPI_MASK_ZPROG_3                             ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_2                            16
#define DPI_MASK_ZPROG_2                             ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_1                            8
#define DPI_MASK_ZPROG_1                             ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_0                            0
#define DPI_MASK_ZPROG_0                             ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_CTRL_ZPROG_5
 * @brief  PAD_CTRL_ZPROG_5                          (@ 0X2FC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZPROG_3                            24
#define DPI_MASK_ZPROG_3                             ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_2                            16
#define DPI_MASK_ZPROG_2                             ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_1                            8
#define DPI_MASK_ZPROG_1                             ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_0                            0
#define DPI_MASK_ZPROG_0                             ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_CTRL_ZPROG_6
 * @brief  PAD_CTRL_ZPROG_6                          (@ 0X300)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZPROG_3                            24
#define DPI_MASK_ZPROG_3                             ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_2                            16
#define DPI_MASK_ZPROG_2                             ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_1                            8
#define DPI_MASK_ZPROG_1                             ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_0                            0
#define DPI_MASK_ZPROG_0                             ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_CTRL_ZPROG_7
 * @brief  PAD_CTRL_ZPROG_7                          (@ 0X304)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_ZPROG_3                            24
#define DPI_MASK_ZPROG_3                             ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_2                            16
#define DPI_MASK_ZPROG_2                             ((u32)0x0000003F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_1                            8
#define DPI_MASK_ZPROG_1                             ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_ZPROG_0                            0
#define DPI_MASK_ZPROG_0                             ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_NOCD2_ZPROG
 * @brief  PAD_NOCD2_ZPROG                           (@ 0X308)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_NOCD2_ZPROG_1                      8
#define DPI_MASK_NOCD2_ZPROG_1                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_NOCD2_ZPROG_0                      0
#define DPI_MASK_NOCD2_ZPROG_0                       ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_NOCD2_ZPROG_1
 * @brief  PAD_NOCD2_ZPROG_1                         (@ 0X30C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_NOCD2_ZPROG_1                      8
#define DPI_MASK_NOCD2_ZPROG_1                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_NOCD2_ZPROG_0                      0
#define DPI_MASK_NOCD2_ZPROG_0                       ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_NOCD2_ZPROG_2
 * @brief  PAD_NOCD2_ZPROG_2                         (@ 0X310)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_NOCD2_ZPROG_1                      8
#define DPI_MASK_NOCD2_ZPROG_1                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_NOCD2_ZPROG_0                      0
#define DPI_MASK_NOCD2_ZPROG_0                       ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_NOCD2_ZPROG_3
 * @brief  PAD_NOCD2_ZPROG_3                         (@ 0X314)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_NOCD2_ZPROG_1                      8
#define DPI_MASK_NOCD2_ZPROG_1                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_NOCD2_ZPROG_0                      0
#define DPI_MASK_NOCD2_ZPROG_0                       ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_NOCD2_ZPROG_4
 * @brief  PAD_NOCD2_ZPROG_4                         (@ 0X318)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_NOCD2_ZPROG_1                      8
#define DPI_MASK_NOCD2_ZPROG_1                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_NOCD2_ZPROG_0                      0
#define DPI_MASK_NOCD2_ZPROG_0                       ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_NOCD2_ZPROG_5
 * @brief  PAD_NOCD2_ZPROG_5                         (@ 0X31C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_NOCD2_ZPROG_1                      8
#define DPI_MASK_NOCD2_ZPROG_1                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_NOCD2_ZPROG_0                      0
#define DPI_MASK_NOCD2_ZPROG_0                       ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_NOCD2_ZPROG_6
 * @brief  PAD_NOCD2_ZPROG_6                         (@ 0X320)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_NOCD2_ZPROG_1                      8
#define DPI_MASK_NOCD2_ZPROG_1                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_NOCD2_ZPROG_0                      0
#define DPI_MASK_NOCD2_ZPROG_0                       ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PAD_NOCD2_ZPROG_7
 * @brief  PAD_NOCD2_ZPROG_7                         (@ 0X324)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_NOCD2_ZPROG_1                      8
#define DPI_MASK_NOCD2_ZPROG_1                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_NOCD2_ZPROG_0                      0
#define DPI_MASK_NOCD2_ZPROG_0                       ((u32)0x0000003F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_OCD_SEL2_0
 * @brief  DQ_OCD_SEL2_0                             (@ 0X328)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_7_OCDN_SEL                      28
#define DPI_MASK_DQ_7_OCDN_SEL                       ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_6_OCDN_SEL                      24
#define DPI_MASK_DQ_6_OCDN_SEL                       ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_7_OCDP_SEL                      20
#define DPI_MASK_DQ_7_OCDP_SEL                       ((u32)0x00000007 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_6_OCDP_SEL                      16
#define DPI_MASK_DQ_6_OCDP_SEL                       ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_5_OCDN_SEL                      12
#define DPI_MASK_DQ_5_OCDN_SEL                       ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_4_OCDN_SEL                      8
#define DPI_MASK_DQ_4_OCDN_SEL                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_5_OCDP_SEL                      4
#define DPI_MASK_DQ_5_OCDP_SEL                       ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_4_OCDP_SEL                      0
#define DPI_MASK_DQ_4_OCDP_SEL                       ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_OCD_SEL2_1
 * @brief  DQ_OCD_SEL2_1                             (@ 0X32C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_7_OCDN_SEL                      28
#define DPI_MASK_DQ_7_OCDN_SEL                       ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_6_OCDN_SEL                      24
#define DPI_MASK_DQ_6_OCDN_SEL                       ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_7_OCDP_SEL                      20
#define DPI_MASK_DQ_7_OCDP_SEL                       ((u32)0x00000007 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_6_OCDP_SEL                      16
#define DPI_MASK_DQ_6_OCDP_SEL                       ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_5_OCDN_SEL                      12
#define DPI_MASK_DQ_5_OCDN_SEL                       ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_4_OCDN_SEL                      8
#define DPI_MASK_DQ_4_OCDN_SEL                       ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_5_OCDP_SEL                      4
#define DPI_MASK_DQ_5_OCDP_SEL                       ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_4_OCDP_SEL                      0
#define DPI_MASK_DQ_4_OCDP_SEL                       ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_OCD_SEL2_0
 * @brief  DQS_OCD_SEL2_0                            (@ 0X330)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_7_OCDN_SEL                     28
#define DPI_MASK_DQS_7_OCDN_SEL                      ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_6_OCDN_SEL                     24
#define DPI_MASK_DQS_6_OCDN_SEL                      ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_7_OCDP_SEL                     20
#define DPI_MASK_DQS_7_OCDP_SEL                      ((u32)0x00000007 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_6_OCDP_SEL                     16
#define DPI_MASK_DQS_6_OCDP_SEL                      ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_5_OCDN_SEL                     12
#define DPI_MASK_DQS_5_OCDN_SEL                      ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_4_OCDN_SEL                     8
#define DPI_MASK_DQS_4_OCDN_SEL                      ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_5_OCDP_SEL                     4
#define DPI_MASK_DQS_5_OCDP_SEL                      ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_4_OCDP_SEL                     0
#define DPI_MASK_DQS_4_OCDP_SEL                      ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_OCD_SEL2_1
 * @brief  DQS_OCD_SEL2_1                            (@ 0X334)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_7_OCDN_SEL                     28
#define DPI_MASK_DQS_7_OCDN_SEL                      ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_6_OCDN_SEL                     24
#define DPI_MASK_DQS_6_OCDN_SEL                      ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_7_OCDP_SEL                     20
#define DPI_MASK_DQS_7_OCDP_SEL                      ((u32)0x00000007 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_6_OCDP_SEL                     16
#define DPI_MASK_DQS_6_OCDP_SEL                      ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_5_OCDN_SEL                     12
#define DPI_MASK_DQS_5_OCDN_SEL                      ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_4_OCDN_SEL                     8
#define DPI_MASK_DQS_4_OCDN_SEL                      ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_5_OCDP_SEL                     4
#define DPI_MASK_DQS_5_OCDP_SEL                      ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_4_OCDP_SEL                     0
#define DPI_MASK_DQS_4_OCDP_SEL                      ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_CTRL2
 * @brief  READ_CTRL2                                (@ 0X408)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_EN_ODT_3_STG                       24
#define DPI_BIT_EN_ODT_3_STG                         ((u32)0x00000001 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_FORCE_SEL                      23
#define DPI_BIT_ODT_FORCE_SEL                        ((u32)0x00000001 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_FORCE_SIG                      22
#define DPI_BIT_ODT_FORCE_SIG                        ((u32)0x00000001 << 22)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_ODT_EN_ODD                      3
#define DPI_BIT_TM_ODT_EN_ODD                        ((u32)0x00000001 << 3)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_TM_ODT_EN_SEL                      1
#define DPI_MASK_TM_ODT_EN_SEL                       ((u32)0x00000003 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_ODT_EN_DLY                      0
#define DPI_BIT_TM_ODT_EN_DLY                        ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_CTRL2_1
 * @brief  READ_CTRL2_1                              (@ 0X40C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_EN_ODT_3_STG                       24
#define DPI_BIT_EN_ODT_3_STG                         ((u32)0x00000001 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_FORCE_SEL                      23
#define DPI_BIT_ODT_FORCE_SEL                        ((u32)0x00000001 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_ODT_FORCE_SIG                      22
#define DPI_BIT_ODT_FORCE_SIG                        ((u32)0x00000001 << 22)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_ODT_EN_ODD                      3
#define DPI_BIT_TM_ODT_EN_ODD                        ((u32)0x00000001 << 3)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_TM_ODT_EN_SEL                      1
#define DPI_MASK_TM_ODT_EN_SEL                       ((u32)0x00000003 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_ODT_EN_DLY                      0
#define DPI_BIT_TM_ODT_EN_DLY                        ((u32)0x00000001 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_CTRL3
 * @brief  READ_CTRL3                                (@ 0X410)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQSEN_CAL_OFFSET4                  25
#define DPI_BIT_DQSEN_CAL_OFFSET4                    ((u32)0x00000001 << 25)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQSEN_DQS_INV                      24
#define DPI_BIT_DQSEN_DQS_INV                        ((u32)0x00000001 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_MCK_RX_INV_SEL                     23
#define DPI_BIT_MCK_RX_INV_SEL                       ((u32)0x00000001 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQSEN_CAL_SEL                      22
#define DPI_BIT_DQSEN_CAL_SEL                        ((u32)0x00000001 << 22)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_EARLY_SEL                      21
#define DPI_BIT_DQS_EARLY_SEL                        ((u32)0x00000001 << 21)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQS_CAL_PRE                     16
#define DPI_MASK_TM_DQS_CAL_PRE                      ((u32)0x0000001F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQSEN_EARLY_PH                  8
#define DPI_MASK_TM_DQSEN_EARLY_PH                   ((u32)0x0000003F << 8)                              /*!<R/W 0xB  RSVD */
#define DPI_SHIFT_TM_DQSEN_LATE_PH                   0
#define DPI_MASK_TM_DQSEN_LATE_PH                    ((u32)0x0000003F << 0)                              /*!<R/W 0xB  RSVD */
/** @} */

