Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup DPI_READ_CTRL3_1
 * @brief  READ_CTRL3_1                              (@ 0X414)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQSEN_CAL_OFFSET4                  25
#define DPI_BIT_DQSEN_CAL_OFFSET4                    ((u32)0x00000001 << 25)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQSEN_DQS_INV                      24
#define DPI_BIT_DQSEN_DQS_INV                        ((u32)0x00000001 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_MCK_RX_INV_SEL                     23
#define DPI_BIT_MCK_RX_INV_SEL                       ((u32)0x00000001 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQSEN_CAL_SEL                      22
#define DPI_BIT_DQSEN_CAL_SEL                        ((u32)0x00000001 << 22)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_EARLY_SEL                      21
#define DPI_BIT_DQS_EARLY_SEL                        ((u32)0x00000001 << 21)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQS_CAL_PRE                     16
#define DPI_MASK_TM_DQS_CAL_PRE                      ((u32)0x0000001F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQSEN_EARLY_PH                  8
#define DPI_MASK_TM_DQSEN_EARLY_PH                   ((u32)0x0000003F << 8)                              /*!<R/W 0xB  RSVD */
#define DPI_SHIFT_TM_DQSEN_LATE_PH                   0
#define DPI_MASK_TM_DQSEN_LATE_PH                    ((u32)0x0000003F << 0)                              /*!<R/W 0xB  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_CTRL6
 * @brief  READ_CTRL6                                (@ 0X418)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_TM_ODT_EN                          0
#define DPI_MASK_TM_ODT_EN                           ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0xFE  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_CTRL6_1
 * @brief  READ_CTRL6_1                              (@ 0X41C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_TM_ODT_EN                          0
#define DPI_MASK_TM_ODT_EN                           ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0xFE  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY0
 * @brief  DQS_IN_DLY0                               (@ 0X420)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_3                24
#define DPI_MASK_FW_RD_DLY_POS_SEL_3                 ((u32)0x0000001F << 24)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_2                16
#define DPI_MASK_FW_RD_DLY_POS_SEL_2                 ((u32)0x0000001F << 16)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_1                8
#define DPI_MASK_FW_RD_DLY_POS_SEL_1                 ((u32)0x0000001F << 8)                              /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_0                0
#define DPI_MASK_FW_RD_DLY_POS_SEL_0                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY0_1
 * @brief  DQS_IN_DLY0_1                             (@ 0X424)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_3                24
#define DPI_MASK_FW_RD_DLY_POS_SEL_3                 ((u32)0x0000001F << 24)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_2                16
#define DPI_MASK_FW_RD_DLY_POS_SEL_2                 ((u32)0x0000001F << 16)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_1                8
#define DPI_MASK_FW_RD_DLY_POS_SEL_1                 ((u32)0x0000001F << 8)                              /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_0                0
#define DPI_MASK_FW_RD_DLY_POS_SEL_0                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY1
 * @brief  DQS_IN_DLY1                               (@ 0X428)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_7                24
#define DPI_MASK_FW_RD_DLY_POS_SEL_7                 ((u32)0x0000001F << 24)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_6                16
#define DPI_MASK_FW_RD_DLY_POS_SEL_6                 ((u32)0x0000001F << 16)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_5                8
#define DPI_MASK_FW_RD_DLY_POS_SEL_5                 ((u32)0x0000001F << 8)                              /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_4                0
#define DPI_MASK_FW_RD_DLY_POS_SEL_4                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY1_1
 * @brief  DQS_IN_DLY1_1                             (@ 0X42C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_7                24
#define DPI_MASK_FW_RD_DLY_POS_SEL_7                 ((u32)0x0000001F << 24)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_6                16
#define DPI_MASK_FW_RD_DLY_POS_SEL_6                 ((u32)0x0000001F << 16)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_5                8
#define DPI_MASK_FW_RD_DLY_POS_SEL_5                 ((u32)0x0000001F << 8)                              /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_4                0
#define DPI_MASK_FW_RD_DLY_POS_SEL_4                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY1_DBI
 * @brief  DQS_IN_DLY1_DBI                           (@ 0X430)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_8                0
#define DPI_MASK_FW_RD_DLY_POS_SEL_8                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY1_DBI_1
 * @brief  DQS_IN_DLY1_DBI_1                         (@ 0X434)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_POS_SEL_8                0
#define DPI_MASK_FW_RD_DLY_POS_SEL_8                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY2
 * @brief  DQS_IN_DLY2                               (@ 0X438)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_3                24
#define DPI_MASK_FW_RD_DLY_NEG_SEL_3                 ((u32)0x0000001F << 24)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_2                16
#define DPI_MASK_FW_RD_DLY_NEG_SEL_2                 ((u32)0x0000001F << 16)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_1                8
#define DPI_MASK_FW_RD_DLY_NEG_SEL_1                 ((u32)0x0000001F << 8)                              /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_0                0
#define DPI_MASK_FW_RD_DLY_NEG_SEL_0                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY2_1
 * @brief  DQS_IN_DLY2_1                             (@ 0X43C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_3                24
#define DPI_MASK_FW_RD_DLY_NEG_SEL_3                 ((u32)0x0000001F << 24)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_2                16
#define DPI_MASK_FW_RD_DLY_NEG_SEL_2                 ((u32)0x0000001F << 16)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_1                8
#define DPI_MASK_FW_RD_DLY_NEG_SEL_1                 ((u32)0x0000001F << 8)                              /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_0                0
#define DPI_MASK_FW_RD_DLY_NEG_SEL_0                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY3
 * @brief  DQS_IN_DLY3                               (@ 0X440)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_7                24
#define DPI_MASK_FW_RD_DLY_NEG_SEL_7                 ((u32)0x0000001F << 24)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_6                16
#define DPI_MASK_FW_RD_DLY_NEG_SEL_6                 ((u32)0x0000001F << 16)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_5                8
#define DPI_MASK_FW_RD_DLY_NEG_SEL_5                 ((u32)0x0000001F << 8)                              /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_4                0
#define DPI_MASK_FW_RD_DLY_NEG_SEL_4                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY3_1
 * @brief  DQS_IN_DLY3_1                             (@ 0X444)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_7                24
#define DPI_MASK_FW_RD_DLY_NEG_SEL_7                 ((u32)0x0000001F << 24)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_6                16
#define DPI_MASK_FW_RD_DLY_NEG_SEL_6                 ((u32)0x0000001F << 16)                             /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_5                8
#define DPI_MASK_FW_RD_DLY_NEG_SEL_5                 ((u32)0x0000001F << 8)                              /*!<R/W 0xA  RSVD */
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_4                0
#define DPI_MASK_FW_RD_DLY_NEG_SEL_4                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY3_DBI
 * @brief  DQS_IN_DLY3_DBI                           (@ 0X448)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_8                0
#define DPI_MASK_FW_RD_DLY_NEG_SEL_8                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQS_IN_DLY3_DBI_1
 * @brief  DQS_IN_DLY3_DBI_1                         (@ 0X44C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_RD_DLY_NEG_SEL_8                0
#define DPI_MASK_FW_RD_DLY_NEG_SEL_8                 ((u32)0x0000001F << 0)                              /*!<R/W 0xA  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_VALID_WIN_DET_PFIFO
 * @brief  VALID_WIN_DET_PFIFO                       (@ 0X450)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RX_LAG_DET_PFIFO                   9
#define DPI_MASK_RX_LAG_DET_PFIFO                    ((u32)0x000001FF << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_RX_LEAD_DET_PFIFO                  0
#define DPI_MASK_RX_LEAD_DET_PFIFO                   ((u32)0x000001FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_VALID_WIN_DET_PFIFO_1
 * @brief  VALID_WIN_DET_PFIFO_1                     (@ 0X454)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RX_LAG_DET_PFIFO                   9
#define DPI_MASK_RX_LAG_DET_PFIFO                    ((u32)0x000001FF << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_RX_LEAD_DET_PFIFO                  0
#define DPI_MASK_RX_LEAD_DET_PFIFO                   ((u32)0x000001FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_VALID_WIN_DET_NFIFO
 * @brief  VALID_WIN_DET_NFIFO                       (@ 0X458)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RX_LAG_DET_NFIFO                   9
#define DPI_MASK_RX_LAG_DET_NFIFO                    ((u32)0x000001FF << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_RX_LEAD_DET_NFIFO                  0
#define DPI_MASK_RX_LEAD_DET_NFIFO                   ((u32)0x000001FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_VALID_WIN_DET_NFIFO_1
 * @brief  VALID_WIN_DET_NFIFO_1                     (@ 0X45C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RX_LAG_DET_NFIFO                   9
#define DPI_MASK_RX_LAG_DET_NFIFO                    ((u32)0x000001FF << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_RX_LEAD_DET_NFIFO                  0
#define DPI_MASK_RX_LEAD_DET_NFIFO                   ((u32)0x000001FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_DLY_0
 * @brief  DQ_DLY_0                                  (@ 0X460)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ7_DLY_SEL                        28
#define DPI_MASK_DQ7_DLY_SEL                         ((u32)0x0000000F << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ6_DLY_SEL                        24
#define DPI_MASK_DQ6_DLY_SEL                         ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ5_DLY_SEL                        20
#define DPI_MASK_DQ5_DLY_SEL                         ((u32)0x0000000F << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ4_DLY_SEL                        16
#define DPI_MASK_DQ4_DLY_SEL                         ((u32)0x0000000F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ3_DLY_SEL                        12
#define DPI_MASK_DQ3_DLY_SEL                         ((u32)0x0000000F << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ2_DLY_SEL                        8
#define DPI_MASK_DQ2_DLY_SEL                         ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ1_DLY_SEL                        4
#define DPI_MASK_DQ1_DLY_SEL                         ((u32)0x0000000F << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ0_DLY_SEL                        0
#define DPI_MASK_DQ0_DLY_SEL                         ((u32)0x0000000F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_DLY_0_1
 * @brief  DQ_DLY_0_1                                (@ 0X464)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ7_DLY_SEL                        28
#define DPI_MASK_DQ7_DLY_SEL                         ((u32)0x0000000F << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ6_DLY_SEL                        24
#define DPI_MASK_DQ6_DLY_SEL                         ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ5_DLY_SEL                        20
#define DPI_MASK_DQ5_DLY_SEL                         ((u32)0x0000000F << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ4_DLY_SEL                        16
#define DPI_MASK_DQ4_DLY_SEL                         ((u32)0x0000000F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ3_DLY_SEL                        12
#define DPI_MASK_DQ3_DLY_SEL                         ((u32)0x0000000F << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ2_DLY_SEL                        8
#define DPI_MASK_DQ2_DLY_SEL                         ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ1_DLY_SEL                        4
#define DPI_MASK_DQ1_DLY_SEL                         ((u32)0x0000000F << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ0_DLY_SEL                        0
#define DPI_MASK_DQ0_DLY_SEL                         ((u32)0x0000000F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_DLY_1
 * @brief  DQ_DLY_1                                  (@ 0X468)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_OE_DLY_SEL                     8
#define DPI_MASK_DQS_OE_DLY_SEL                      ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_DLY_SEL                         4
#define DPI_MASK_DM_DLY_SEL                          ((u32)0x0000000F << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_DLY_SEL                        0
#define DPI_MASK_DQS_DLY_SEL                         ((u32)0x0000000F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_DLY_1_1
 * @brief  DQ_DLY_1_1                                (@ 0X46C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_OE_DLY_SEL                     8
#define DPI_MASK_DQS_OE_DLY_SEL                      ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_DLY_SEL                         4
#define DPI_MASK_DM_DLY_SEL                          ((u32)0x0000000F << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_DLY_SEL                        0
#define DPI_MASK_DQS_DLY_SEL                         ((u32)0x0000000F << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CAL_OUT_0
 * @brief  CAL_OUT_0                                 (@ 0X470)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CAL_RD_DLY_OUT                     0
#define DPI_MASK_CAL_RD_DLY_OUT                      ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CAL_OUT_0_1
 * @brief  CAL_OUT_0_1                               (@ 0X474)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CAL_RD_DLY_OUT                     0
#define DPI_MASK_CAL_RD_DLY_OUT                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_WR_FIFO_0
 * @brief  WR_FIFO_0                                 (@ 0X478)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_WR_ADR_POS                         0
#define DPI_MASK_WR_ADR_POS                          ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_WR_FIFO_0_1
 * @brief  WR_FIFO_0_1                               (@ 0X47C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_WR_ADR_POS                         0
#define DPI_MASK_WR_ADR_POS                          ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_WR_FIFO_1
 * @brief  WR_FIFO_1                                 (@ 0X480)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_WR_ADR_NEG                         0
#define DPI_MASK_WR_ADR_NEG                          ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_WR_FIFO_1_1
 * @brief  WR_FIFO_1_1                               (@ 0X484)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_WR_ADR_NEG                         0
#define DPI_MASK_WR_ADR_NEG                          ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_RD_FIFO_0
 * @brief  RD_FIFO_0                                 (@ 0X488)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RD_ADR_POS                         0
#define DPI_MASK_RD_ADR_POS                          ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_RD_FIFO_0_1
 * @brief  RD_FIFO_0_1                               (@ 0X48C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RD_ADR_POS                         0
#define DPI_MASK_RD_ADR_POS                          ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_RD_FIFO_1
 * @brief  RD_FIFO_1                                 (@ 0X490)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RD_ADR_NEG                         0
#define DPI_MASK_RD_ADR_NEG                          ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

