Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup DPI_RD_FIFO_1_1
 * @brief  RD_FIFO_1_1                               (@ 0X494)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RD_ADR_NEG                         0
#define DPI_MASK_RD_ADR_NEG                          ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DBI_FIFO
 * @brief  DBI_FIFO                                  (@ 0X498)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RW_ADR_DBI                         0
#define DPI_MASK_RW_ADR_DBI                          ((u32)0x0000FFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DBI_FIFO_1
 * @brief  DBI_FIFO_1                                (@ 0X49C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_RW_ADR_DBI                         0
#define DPI_MASK_RW_ADR_DBI                          ((u32)0x0000FFFF << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_INT_STATUS_1
 * @brief  INT_STATUS_1                              (@ 0X4A0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CAL_RBDY_INT_NEG                   24
#define DPI_MASK_CAL_RBDY_INT_NEG                    ((u32)0x000000FF << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_LBDY_INT_NEG                   16
#define DPI_MASK_CAL_LBDY_INT_NEG                    ((u32)0x000000FF << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_RBDY_INT_POS                   8
#define DPI_MASK_CAL_RBDY_INT_POS                    ((u32)0x000000FF << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_LBDY_INT_POS                   0
#define DPI_MASK_CAL_LBDY_INT_POS                    ((u32)0x000000FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_INT_STATUS_1_1
 * @brief  INT_STATUS_1_1                            (@ 0X4A4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CAL_RBDY_INT_NEG                   24
#define DPI_MASK_CAL_RBDY_INT_NEG                    ((u32)0x000000FF << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_LBDY_INT_NEG                   16
#define DPI_MASK_CAL_LBDY_INT_NEG                    ((u32)0x000000FF << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_RBDY_INT_POS                   8
#define DPI_MASK_CAL_RBDY_INT_POS                    ((u32)0x000000FF << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_LBDY_INT_POS                   0
#define DPI_MASK_CAL_LBDY_INT_POS                    ((u32)0x000000FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_INT_STATUS_3
 * @brief  INT_STATUS_3                              (@ 0X4A8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CAL_RBDY_INT3_NEG                   21
#define DPI_BIT_CAL_RBDY_INT3_NEG                     ((u32)0x00000001 << 21)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_LBDY_INT3_NEG                   20
#define DPI_BIT_CAL_LBDY_INT3_NEG                     ((u32)0x00000001 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_RBDY_INT3_POS                   19
#define DPI_BIT_CAL_RBDY_INT3_POS                     ((u32)0x00000001 << 19)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_LBDY_INT3_POS                   18
#define DPI_BIT_CAL_LBDY_INT3_POS                     ((u32)0x00000001 << 18)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_FIFO_PTR_INT3_NEG                   9
#define DPI_MASK_FIFO_PTR_INT3_NEG                    ((u32)0x000001FF << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_FIFO_PTR_INT3_POS                   0
#define DPI_MASK_FIFO_PTR_INT3_POS                    ((u32)0x000001FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_INT_STATUS_3_1
 * @brief  INT_STATUS_3_1                            (@ 0X4AC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CAL_RBDY_INT3_NEG                   21
#define DPI_BIT_CAL_RBDY_INT3_NEG                     ((u32)0x00000001 << 21)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_LBDY_INT3_NEG                   20
#define DPI_BIT_CAL_LBDY_INT3_NEG                     ((u32)0x00000001 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_RBDY_INT3_POS                   19
#define DPI_BIT_CAL_RBDY_INT3_POS                     ((u32)0x00000001 << 19)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_LBDY_INT3_POS                   18
#define DPI_BIT_CAL_LBDY_INT3_POS                     ((u32)0x00000001 << 18)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_FIFO_PTR_INT3_NEG                   9
#define DPI_MASK_FIFO_PTR_INT3_NEG                    ((u32)0x000001FF << 9)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_FIFO_PTR_INT3_POS                   0
#define DPI_MASK_FIFO_PTR_INT3_POS                    ((u32)0x000001FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PRBS_TMUX4
 * @brief  PRBS_TMUX4                                (@ 0X4B8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_TEST                           31
#define DPI_BIT_DQS_TEST                             ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ5_SEL                            28
#define DPI_MASK_DQ5_SEL                             ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ4_SEL                            24
#define DPI_MASK_DQ4_SEL                             ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ3_SEL                            20
#define DPI_MASK_DQ3_SEL                             ((u32)0x00000007 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ2_SEL                            16
#define DPI_MASK_DQ2_SEL                             ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ1_SEL                            12
#define DPI_MASK_DQ1_SEL                             ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ0_SEL                            8
#define DPI_MASK_DQ0_SEL                             ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PRBS_TMUX4_1
 * @brief  PRBS_TMUX4_1                              (@ 0X4BC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_TEST                           31
#define DPI_BIT_DQS_TEST                             ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ5_SEL                            28
#define DPI_MASK_DQ5_SEL                             ((u32)0x00000007 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ4_SEL                            24
#define DPI_MASK_DQ4_SEL                             ((u32)0x00000007 << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ3_SEL                            20
#define DPI_MASK_DQ3_SEL                             ((u32)0x00000007 << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ2_SEL                            16
#define DPI_MASK_DQ2_SEL                             ((u32)0x00000007 << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ1_SEL                            12
#define DPI_MASK_DQ1_SEL                             ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ0_SEL                            8
#define DPI_MASK_DQ0_SEL                             ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PRBS_TMUX5
 * @brief  PRBS_TMUX5                                (@ 0X4C0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DATA_PRBS11_INVS                   31
#define DPI_BIT_DATA_PRBS11_INVS                     ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DATA_PRBS11_SEED                   16
#define DPI_MASK_DATA_PRBS11_SEED                    ((u32)0x000007FF << 16)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DM_SEL                             8
#define DPI_MASK_DM_SEL                              ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ7_SEL                            4
#define DPI_MASK_DQ7_SEL                             ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ6_SEL                            0
#define DPI_MASK_DQ6_SEL                             ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_PRBS_TMUX5_1
 * @brief  PRBS_TMUX5_1                              (@ 0X4C4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DATA_PRBS11_INVS                   31
#define DPI_BIT_DATA_PRBS11_INVS                     ((u32)0x00000001 << 31)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DATA_PRBS11_SEED                   16
#define DPI_MASK_DATA_PRBS11_SEED                    ((u32)0x000007FF << 16)                             /*!<R/W 1  RSVD */
#define DPI_SHIFT_DM_SEL                             8
#define DPI_MASK_DM_SEL                              ((u32)0x00000007 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ7_SEL                            4
#define DPI_MASK_DQ7_SEL                             ((u32)0x00000007 << 4)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ6_SEL                            0
#define DPI_MASK_DQ6_SEL                             ((u32)0x00000007 << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_RW_EMPH_CTL
 * @brief  RW_EMPH_CTL                               (@ 0X4C8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_SLEWRATE                       28
#define DPI_MASK_DQS_SLEWRATE                        ((u32)0x00000003 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_DLY_EMPH                       24
#define DPI_MASK_DQS_DLY_EMPH                        ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_SLEWRATE                        12
#define DPI_MASK_DQ_SLEWRATE                         ((u32)0x00000003 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_DLY_EMPH                        8
#define DPI_MASK_DQ_DLY_EMPH                         ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_RW_EMPH_CTL_1
 * @brief  RW_EMPH_CTL_1                             (@ 0X4CC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_SLEWRATE                       28
#define DPI_MASK_DQS_SLEWRATE                        ((u32)0x00000003 << 28)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_DLY_EMPH                       24
#define DPI_MASK_DQS_DLY_EMPH                        ((u32)0x0000000F << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_SLEWRATE                        12
#define DPI_MASK_DQ_SLEWRATE                         ((u32)0x00000003 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_DLY_EMPH                        8
#define DPI_MASK_DQ_DLY_EMPH                         ((u32)0x0000000F << 8)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_RW_SEL_EMPH_CTL
 * @brief  RW_SEL_EMPH_CTL                           (@ 0X4D0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_SEL_EMPHN                      20
#define DPI_MASK_DQS_SEL_EMPHN                       ((u32)0x0000000F << 20)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_DQS_SEL_EMPHP                      16
#define DPI_MASK_DQS_SEL_EMPHP                       ((u32)0x0000000F << 16)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_DQ_SEL_EMPHN                       4
#define DPI_MASK_DQ_SEL_EMPHN                        ((u32)0x0000000F << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_DQ_SEL_EMPHP                       0
#define DPI_MASK_DQ_SEL_EMPHP                        ((u32)0x0000000F << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_RW_SEL_EMPH_CTL_1
 * @brief  RW_SEL_EMPH_CTL_1                         (@ 0X4D4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_SEL_EMPHN                      20
#define DPI_MASK_DQS_SEL_EMPHN                       ((u32)0x0000000F << 20)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_DQS_SEL_EMPHP                      16
#define DPI_MASK_DQS_SEL_EMPHP                       ((u32)0x0000000F << 16)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_DQ_SEL_EMPHN                       4
#define DPI_MASK_DQ_SEL_EMPHN                        ((u32)0x0000000F << 4)                              /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_DQ_SEL_EMPHP                       0
#define DPI_MASK_DQ_SEL_EMPHP                        ((u32)0x0000000F << 0)                              /*!<R/W 0x7  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_IO_CTL_0
 * @brief  DQ_IO_CTL_0                               (@ 0X4D8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_OE_SIG                          24
#define DPI_MASK_DQ_OE_SIG                           ((u32)0x000000FF << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_OE_FRC_EN                       16
#define DPI_MASK_DQ_OE_FRC_EN                        ((u32)0x000000FF << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_IE_SIG                          8
#define DPI_MASK_DQ_IE_SIG                           ((u32)0x000000FF << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_IE_FRC_EN                       0
#define DPI_MASK_DQ_IE_FRC_EN                        ((u32)0x000000FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_IO_CTL_0_1
 * @brief  DQ_IO_CTL_0_1                             (@ 0X4DC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_OE_SIG                          24
#define DPI_MASK_DQ_OE_SIG                           ((u32)0x000000FF << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_OE_FRC_EN                       16
#define DPI_MASK_DQ_OE_FRC_EN                        ((u32)0x000000FF << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_IE_SIG                          8
#define DPI_MASK_DQ_IE_SIG                           ((u32)0x000000FF << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_IE_FRC_EN                       0
#define DPI_MASK_DQ_IE_FRC_EN                        ((u32)0x000000FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_IO_CTL_1
 * @brief  DQ_IO_CTL_1                               (@ 0X4E0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_PAT_OUT                         24
#define DPI_MASK_DQ_PAT_OUT                          ((u32)0x000000FF << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_PAT_OUT                         23
#define DPI_BIT_DM_PAT_OUT                           ((u32)0x00000001 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_OE_SIG                          3
#define DPI_BIT_DM_OE_SIG                            ((u32)0x00000001 << 3)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_OE_FRC_EN                       2
#define DPI_BIT_DM_OE_FRC_EN                         ((u32)0x00000001 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_IE_SIG                          1
#define DPI_BIT_DM_IE_SIG                            ((u32)0x00000001 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_IE_FRC_EN                       0
#define DPI_BIT_DM_IE_FRC_EN                         ((u32)0x00000001 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_IO_CTL_1_1
 * @brief  DQ_IO_CTL_1_1                             (@ 0X4E4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQ_PAT_OUT                         24
#define DPI_MASK_DQ_PAT_OUT                          ((u32)0x000000FF << 24)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_PAT_OUT                         23
#define DPI_BIT_DM_PAT_OUT                           ((u32)0x00000001 << 23)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_OE_SIG                          3
#define DPI_BIT_DM_OE_SIG                            ((u32)0x00000001 << 3)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_OE_FRC_EN                       2
#define DPI_BIT_DM_OE_FRC_EN                         ((u32)0x00000001 << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_IE_SIG                          1
#define DPI_BIT_DM_IE_SIG                            ((u32)0x00000001 << 1)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DM_IE_FRC_EN                       0
#define DPI_BIT_DM_IE_FRC_EN                         ((u32)0x00000001 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_DBG_CTRL
 * @brief  READ_DBG_CTRL                             (@ 0X4E8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_BURST_MON_WAIT_TIME            26
#define DPI_MASK_DQS_BURST_MON_WAIT_TIME             ((u32)0x0000000F << 26)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_RD_DBG_SEL1                        21
#define DPI_MASK_RD_DBG_SEL1                         ((u32)0x0000001F << 21)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RD_DBG_SEL0                        16
#define DPI_MASK_RD_DBG_SEL0                         ((u32)0x0000001F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_RD_DLY_OUT_SEL                 12
#define DPI_MASK_CAL_RD_DLY_OUT_SEL                  ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TX_WDATA_MASK                      10
#define DPI_BIT_TX_WDATA_MASK                        ((u32)0x00000001 << 10)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_DM_PD_EN                       8
#define DPI_MASK_DQS_DM_PD_EN                        ((u32)0x00000003 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_PD_EN                           0
#define DPI_MASK_DQ_PD_EN                            ((u32)0x000000FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_DBG_CTRL_1
 * @brief  READ_DBG_CTRL_1                           (@ 0X4EC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_BURST_MON_WAIT_TIME            26
#define DPI_MASK_DQS_BURST_MON_WAIT_TIME             ((u32)0x0000000F << 26)                             /*!<R/W 0x7  RSVD */
#define DPI_SHIFT_RD_DBG_SEL1                        21
#define DPI_MASK_RD_DBG_SEL1                         ((u32)0x0000001F << 21)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_RD_DBG_SEL0                        16
#define DPI_MASK_RD_DBG_SEL0                         ((u32)0x0000001F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_CAL_RD_DLY_OUT_SEL                 12
#define DPI_MASK_CAL_RD_DLY_OUT_SEL                  ((u32)0x00000007 << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TX_WDATA_MASK                      10
#define DPI_BIT_TX_WDATA_MASK                        ((u32)0x00000001 << 10)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_DM_PD_EN                       8
#define DPI_MASK_DQS_DM_PD_EN                        ((u32)0x00000003 << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQ_PD_EN                           0
#define DPI_MASK_DQ_PD_EN                            ((u32)0x000000FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

