Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup DPI_MON
 * @brief  MON                                       (@ 0X4F0)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CAL_FTUN_UNDER_FLG                 30
#define DPI_BIT_CAL_FTUN_UNDER_FLG                   ((u32)0x00000001 << 30)                             /*!<R 0  RSVD */
#define DPI_SHIFT_CAL_FTUN_OVER_FLG                  29
#define DPI_BIT_CAL_FTUN_OVER_FLG                    ((u32)0x00000001 << 29)                             /*!<R 0  RSVD */
#define DPI_SHIFT_CAL_FTUN_BOTH_HIT_FLG              28
#define DPI_BIT_CAL_FTUN_BOTH_HIT_FLG                ((u32)0x00000001 << 28)                             /*!<R 0  RSVD */
#define DPI_SHIFT_FW_TM_DQS_EN_FTUN                  24
#define DPI_MASK_FW_TM_DQS_EN_FTUN                   ((u32)0x0000000F << 24)                             /*!<R 0x3  RSVD */
#define DPI_SHIFT_DQS_EN_DLY_SEL_PH                  16
#define DPI_MASK_DQS_EN_DLY_SEL_PH                   ((u32)0x0000003F << 16)                             /*!<R 0x10  RSVD */
#define DPI_SHIFT_MON_BURST_CNT                      4
#define DPI_MASK_MON_BURST_CNT                       ((u32)0x0000000F << 4)                              /*!<R 0  RSVD */
#define DPI_SHIFT_MON_DQS_CNT                        0
#define DPI_MASK_MON_DQS_CNT                         ((u32)0x0000000F << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_MON_1
 * @brief  MON_1                                     (@ 0X4F4)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_CAL_FTUN_UNDER_FLG                 30
#define DPI_BIT_CAL_FTUN_UNDER_FLG                   ((u32)0x00000001 << 30)                             /*!<R 0  RSVD */
#define DPI_SHIFT_CAL_FTUN_OVER_FLG                  29
#define DPI_BIT_CAL_FTUN_OVER_FLG                    ((u32)0x00000001 << 29)                             /*!<R 0  RSVD */
#define DPI_SHIFT_CAL_FTUN_BOTH_HIT_FLG              28
#define DPI_BIT_CAL_FTUN_BOTH_HIT_FLG                ((u32)0x00000001 << 28)                             /*!<R 0  RSVD */
#define DPI_SHIFT_FW_TM_DQS_EN_FTUN                  24
#define DPI_MASK_FW_TM_DQS_EN_FTUN                   ((u32)0x0000000F << 24)                             /*!<R 0x3  RSVD */
#define DPI_SHIFT_DQS_EN_DLY_SEL_PH                  16
#define DPI_MASK_DQS_EN_DLY_SEL_PH                   ((u32)0x0000003F << 16)                             /*!<R 0x10  RSVD */
#define DPI_SHIFT_MON_BURST_CNT                      4
#define DPI_MASK_MON_BURST_CNT                       ((u32)0x0000000F << 4)                              /*!<R 0  RSVD */
#define DPI_SHIFT_MON_DQS_CNT                        0
#define DPI_MASK_MON_DQS_CNT                         ((u32)0x0000000F << 0)                              /*!<R 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CAL_LS_SEL
 * @brief  CAL_LS_SEL                                (@ 0X4F8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_PRE_SHIFT_SEL_7                    28
#define DPI_MASK_PRE_SHIFT_SEL_7                     ((u32)0x00000007 << 28)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_6                    24
#define DPI_MASK_PRE_SHIFT_SEL_6                     ((u32)0x00000007 << 24)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_5                    20
#define DPI_MASK_PRE_SHIFT_SEL_5                     ((u32)0x00000007 << 20)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_4                    16
#define DPI_MASK_PRE_SHIFT_SEL_4                     ((u32)0x00000007 << 16)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_3                    12
#define DPI_MASK_PRE_SHIFT_SEL_3                     ((u32)0x00000007 << 12)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_2                    8
#define DPI_MASK_PRE_SHIFT_SEL_2                     ((u32)0x00000007 << 8)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_1                    4
#define DPI_MASK_PRE_SHIFT_SEL_1                     ((u32)0x00000007 << 4)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_0                    0
#define DPI_MASK_PRE_SHIFT_SEL_0                     ((u32)0x00000007 << 0)                              /*!<R/W 0x2  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CAL_LS_SEL_1
 * @brief  CAL_LS_SEL_1                              (@ 0X4FC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_PRE_SHIFT_SEL_7                    28
#define DPI_MASK_PRE_SHIFT_SEL_7                     ((u32)0x00000007 << 28)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_6                    24
#define DPI_MASK_PRE_SHIFT_SEL_6                     ((u32)0x00000007 << 24)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_5                    20
#define DPI_MASK_PRE_SHIFT_SEL_5                     ((u32)0x00000007 << 20)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_4                    16
#define DPI_MASK_PRE_SHIFT_SEL_4                     ((u32)0x00000007 << 16)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_3                    12
#define DPI_MASK_PRE_SHIFT_SEL_3                     ((u32)0x00000007 << 12)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_2                    8
#define DPI_MASK_PRE_SHIFT_SEL_2                     ((u32)0x00000007 << 8)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_1                    4
#define DPI_MASK_PRE_SHIFT_SEL_1                     ((u32)0x00000007 << 4)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_PRE_SHIFT_SEL_0                    0
#define DPI_MASK_PRE_SHIFT_SEL_0                     ((u32)0x00000007 << 0)                              /*!<R/W 0x2  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CAL_LS_SEL_DBI
 * @brief  CAL_LS_SEL_DBI                            (@ 0X500)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_PRE_SHIFT_SEL_8                    0
#define DPI_MASK_PRE_SHIFT_SEL_8                     ((u32)0x00000007 << 0)                              /*!<R/W 0x2  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CAL_LS_SEL_DBI_1
 * @brief  CAL_LS_SEL_DBI_1                          (@ 0X504)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_PRE_SHIFT_SEL_8                    0
#define DPI_MASK_PRE_SHIFT_SEL_8                     ((u32)0x00000007 << 0)                              /*!<R/W 0x2  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CAL_RS_SEL
 * @brief  CAL_RS_SEL                                (@ 0X508)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_POST_SHIFT_SEL_7                   28
#define DPI_MASK_POST_SHIFT_SEL_7                    ((u32)0x00000007 << 28)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_6                   24
#define DPI_MASK_POST_SHIFT_SEL_6                    ((u32)0x00000007 << 24)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_5                   20
#define DPI_MASK_POST_SHIFT_SEL_5                    ((u32)0x00000007 << 20)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_4                   16
#define DPI_MASK_POST_SHIFT_SEL_4                    ((u32)0x00000007 << 16)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_3                   12
#define DPI_MASK_POST_SHIFT_SEL_3                    ((u32)0x00000007 << 12)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_2                   8
#define DPI_MASK_POST_SHIFT_SEL_2                    ((u32)0x00000007 << 8)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_1                   4
#define DPI_MASK_POST_SHIFT_SEL_1                    ((u32)0x00000007 << 4)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_0                   0
#define DPI_MASK_POST_SHIFT_SEL_0                    ((u32)0x00000007 << 0)                              /*!<R/W 0x2  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CAL_RS_SEL_1
 * @brief  CAL_RS_SEL_1                              (@ 0X50C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_POST_SHIFT_SEL_7                   28
#define DPI_MASK_POST_SHIFT_SEL_7                    ((u32)0x00000007 << 28)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_6                   24
#define DPI_MASK_POST_SHIFT_SEL_6                    ((u32)0x00000007 << 24)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_5                   20
#define DPI_MASK_POST_SHIFT_SEL_5                    ((u32)0x00000007 << 20)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_4                   16
#define DPI_MASK_POST_SHIFT_SEL_4                    ((u32)0x00000007 << 16)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_3                   12
#define DPI_MASK_POST_SHIFT_SEL_3                    ((u32)0x00000007 << 12)                             /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_2                   8
#define DPI_MASK_POST_SHIFT_SEL_2                    ((u32)0x00000007 << 8)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_1                   4
#define DPI_MASK_POST_SHIFT_SEL_1                    ((u32)0x00000007 << 4)                              /*!<R/W 0x2  RSVD */
#define DPI_SHIFT_POST_SHIFT_SEL_0                   0
#define DPI_MASK_POST_SHIFT_SEL_0                    ((u32)0x00000007 << 0)                              /*!<R/W 0x2  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CAL_RS_SEL_DBI
 * @brief  CAL_RS_SEL_DBI                            (@ 0X510)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_POST_SHIFT_SEL_8                   0
#define DPI_MASK_POST_SHIFT_SEL_8                    ((u32)0x00000007 << 0)                              /*!<R/W 0x2  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_CAL_RS_SEL_DBI_1
 * @brief  CAL_RS_SEL_DBI_1                          (@ 0X514)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_POST_SHIFT_SEL_8                   0
#define DPI_MASK_POST_SHIFT_SEL_8                    ((u32)0x00000007 << 0)                              /*!<R/W 0x2  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_IO_CTL_2
 * @brief  DQ_IO_CTL_2                               (@ 0X518)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQM_OE_TIME                        12
#define DPI_MASK_DQM_OE_TIME                         ((u32)0x0000000F << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DATA_INV                           0
#define DPI_MASK_DATA_INV                            ((u32)0x000001FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_DQ_IO_CTL_2_1
 * @brief  DQ_IO_CTL_2_1                             (@ 0X51C)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQM_OE_TIME                        12
#define DPI_MASK_DQM_OE_TIME                         ((u32)0x0000000F << 12)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DATA_INV                           0
#define DPI_MASK_DATA_INV                            ((u32)0x000001FF << 0)                              /*!<R/W 0  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_CTRL_4
 * @brief  READ_CTRL_4                               (@ 0X520)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_DQSEN_FTUN_UPD                  1
#define DPI_BIT_FW_DQSEN_FTUN_UPD                    ((u32)0x00000001 << 1)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_FW_RD_TE_UPD                       0
#define DPI_BIT_FW_RD_TE_UPD                         ((u32)0x00000001 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_CTRL_4_1
 * @brief  READ_CTRL_4_1                             (@ 0X524)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_FW_DQSEN_FTUN_UPD                  1
#define DPI_BIT_FW_DQSEN_FTUN_UPD                    ((u32)0x00000001 << 1)                              /*!<R/W 1  RSVD */
#define DPI_SHIFT_FW_RD_TE_UPD                       0
#define DPI_BIT_FW_RD_TE_UPD                         ((u32)0x00000001 << 0)                              /*!<R/W 1  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_CTRL_0_0
 * @brief  READ_CTRL_0_0                             (@ 0X5F8)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_RC1IN_DLY_SEL                  26
#define DPI_MASK_DQS_RC1IN_DLY_SEL                   ((u32)0x0000001F << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_GLITCH_DLY_PH                  20
#define DPI_MASK_DQS_GLITCH_DLY_PH                   ((u32)0x0000000F << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQ_LAT_DLY                      16
#define DPI_MASK_TM_DQ_LAT_DLY                       ((u32)0x0000000F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_FIFO_DLY_SEL                   14
#define DPI_MASK_DQS_FIFO_DLY_SEL                    ((u32)0x00000003 << 14)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_EN_DLY_SEL                     8
#define DPI_MASK_DQS_EN_DLY_SEL                      ((u32)0x0000003F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQS_EN                          2
#define DPI_MASK_TM_DQS_EN                           ((u32)0x0000001F << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQS_EN_FTUN                     0
#define DPI_MASK_TM_DQS_EN_FTUN                      ((u32)0x00000003 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

/**************************************************************************//**
 * @defgroup DPI_READ_CTRL_0_1
 * @brief  READ_CTRL_0_1                             (@ 0X5FC)
 * @{
 *****************************************************************************/
#define DPI_SHIFT_DQS_RC1IN_DLY_SEL                  26
#define DPI_MASK_DQS_RC1IN_DLY_SEL                   ((u32)0x0000001F << 26)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_GLITCH_DLY_PH                  20
#define DPI_MASK_DQS_GLITCH_DLY_PH                   ((u32)0x0000000F << 20)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQ_LAT_DLY                      16
#define DPI_MASK_TM_DQ_LAT_DLY                       ((u32)0x0000000F << 16)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_FIFO_DLY_SEL                   14
#define DPI_MASK_DQS_FIFO_DLY_SEL                    ((u32)0x00000003 << 14)                             /*!<R/W 0  RSVD */
#define DPI_SHIFT_DQS_EN_DLY_SEL                     8
#define DPI_MASK_DQS_EN_DLY_SEL                      ((u32)0x0000003F << 8)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQS_EN                          2
#define DPI_MASK_TM_DQS_EN                           ((u32)0x0000001F << 2)                              /*!<R/W 0  RSVD */
#define DPI_SHIFT_TM_DQS_EN_FTUN                     0
#define DPI_MASK_TM_DQS_EN_FTUN                      ((u32)0x00000003 << 0)                              /*!<R/W 0x3  RSVD */
/** @} */

