Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_DPI
 * @{
 * @brief rtl8735b_DPI Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t DPI_CRT_CTL ;                            /*!<  CRT_CTL register,  Address offset: 0x000 */
	__IO uint32_t DPI_PLL_CTL0 ;                           /*!<  PLL_CTL0 register,  Address offset: 0x004 */
	__IO uint32_t DPI_PLL_CTL1 ;                           /*!<  PLL_CTL1 register,  Address offset: 0x008 */
	__IO uint32_t DPI_PLL_CTL2 ;                           /*!<  PLL_CTL2 register,  Address offset: 0x00C */
	__IO uint32_t DPI_PLL_PI0 ;                            /*!<  PLL_PI0 register,  Address offset: 0x010 */
	__IO uint32_t DPI_PLL_PI1 ;                            /*!<  PLL_PI1 register,  Address offset: 0x014 */
	__IO uint32_t DPI_PLL_CTL3 ;                           /*!<  PLL_CTL3 register,  Address offset: 0x018 */
	__IO uint32_t DPI_SSC0 ;                               /*!<  SSC0 register,  Address offset: 0x01C */
	__IO uint32_t DPI_SSC1 ;                               /*!<  SSC1 register,  Address offset: 0x020 */
	__IO uint32_t DPI_SSC2 ;                               /*!<  SSC2 register,  Address offset: 0x024 */
	__IO uint32_t DPI_SSC3 ;                               /*!<  SSC3 register,  Address offset: 0x028 */
	__IO uint32_t DPI_WDOG ;                               /*!<  WDOG register,  Address offset: 0x02C */
	__IO uint32_t DPI_DCC_CMD ;                            /*!<  DCC_CMD register,  Address offset: 0x030 */
	__IO uint32_t DPI_DCC_DQS_0 ;                          /*!<  DCC_DQS_0 register,  Address offset: 0x034 */
	__IO uint32_t DPI_DCC_DQS_1 ;                          /*!<  DCC_DQS_1 register,  Address offset: 0x038 */
	__IO uint32_t DPI_DCC_DQS_2 ;                          /*!<  DCC_DQS_2 register,  Address offset: 0x03C */
	__IO uint32_t DPI_DCC_DQS_3 ;                          /*!<  DCC_DQS_3 register,  Address offset: 0x040 */
	__IO uint32_t DPI_DCC_DQ_0 ;                           /*!<  DCC_DQ_0 register,  Address offset: 0x044 */
	__IO uint32_t DPI_DCC_DQ_1 ;                           /*!<  DCC_DQ_1 register,  Address offset: 0x048 */
	__IO uint32_t DPI_DCC_DQ_2 ;                           /*!<  DCC_DQ_2 register,  Address offset: 0x04C */
	__IO uint32_t DPI_DCC_DQ_3 ;                           /*!<  DCC_DQ_3 register,  Address offset: 0x050 */
	__IO uint32_t DPI_DCC_CK_0 ;                           /*!<  DCC_CK_0 register,  Address offset: 0x054 */
	__IO uint32_t DPI_DCC_CK_1 ;                           /*!<  DCC_CK_1 register,  Address offset: 0x058 */
	__IO uint32_t RSVD0;                                  /*!<  Reserved,  Address offset:0x5C */
	__IO uint32_t DPI_CRT_CTL_2 ;                          /*!<  CRT_CTL_2 register,  Address offset: 0x060 */
	__IO uint32_t RSVD1[7];                                /*!<  Reserved,  Address offset:0x64-0x7C */
	__IO uint32_t DPI_AFIFO_STR_0 ;                        /*!<  AFIFO_STR_0 register,  Address offset: 0x080 */
	__IO uint32_t DPI_AFIFO_STR_1 ;                        /*!<  AFIFO_STR_1 register,  Address offset: 0x084 */
	__IO uint32_t DPI_AFIFO_STR_2 ;                        /*!<  AFIFO_STR_2 register,  Address offset: 0x088 */
	__IO uint32_t DPI_CRT_RST_CTL ;                        /*!<  CRT_RST_CTL register,  Address offset: 0x08C */
	__IO uint32_t RSVD2;                                  /*!<  Reserved,  Address offset:0x90 */
	__IO uint32_t DPI_AFIFO_STR_SEL ;                      /*!<  AFIFO_STR_SEL register,  Address offset: 0x094 */
	__IO uint32_t DPI_PLL_PI2 ;                            /*!<  PLL_PI2 register,  Address offset: 0x098 */
	__IO uint32_t DPI_PLL_CTL4 ;                           /*!<  PLL_CTL4 register,  Address offset: 0x09C */
	__IO uint32_t DPI_PLL_PI3 ;                            /*!<  PLL_PI3 register,  Address offset: 0x0A0 */
	__IO uint32_t DPI_DCC_CS ;                             /*!<  DCC_CS register,  Address offset: 0x0A4 */
	__IO uint32_t DPI_DCC_CS1 ;                            /*!<  DCC_CS1 register,  Address offset: 0x0A8 */
	__IO uint32_t DPI_PLL_CTL5 ;                           /*!<  PLL_CTL5 register,  Address offset: 0x0AC */
	__IO uint32_t RSVD3[20];                               /*!<  Reserved,  Address offset:0xB0-0xFC */
	__IO uint32_t DPI_ADR_DLY_0 ;                          /*!<  ADR_DLY_0 register,  Address offset: 0x100 */
	__IO uint32_t DPI_ADR_DLY_1 ;                          /*!<  ADR_DLY_1 register,  Address offset: 0x104 */
	__IO uint32_t DPI_ADR_DLY_2 ;                          /*!<  ADR_DLY_2 register,  Address offset: 0x108 */
	__IO uint32_t DPI_CMD_DLY_0 ;                          /*!<  CMD_DLY_0 register,  Address offset: 0x10C */
	__IO uint32_t DPI_CMD_DLY_1 ;                          /*!<  CMD_DLY_1 register,  Address offset: 0x110 */
	__IO uint32_t DPI_PAD_OE_CTL ;                         /*!<  PAD_OE_CTL register,  Address offset: 0x114 */
	__IO uint32_t DPI_PAD_OE_CTL_EX ;                      /*!<  PAD_OE_CTL_EX register,  Address offset: 0x118 */
	__IO uint32_t DPI_PAD_ALERT_SEL_0 ;                    /*!<  PAD_ALERT_SEL_0 register,  Address offset: 0x11C */
	__IO uint32_t DPI_PAD_ALERT_SEL_1 ;                    /*!<  PAD_ALERT_SEL_1 register,  Address offset: 0x120 */
	__IO uint32_t DPI_PAD_ALERT1_SEL_0 ;                   /*!<  PAD_ALERT1_SEL_0 register,  Address offset: 0x124 */
	__IO uint32_t DPI_PAD_ALERT1_SEL_1 ;                   /*!<  PAD_ALERT1_SEL_1 register,  Address offset: 0x128 */
	__IO uint32_t DPI_PAD_IDDQ ;                           /*!<  PAD_IDDQ register,  Address offset: 0x12C */
	__IO uint32_t DPI_PAD_CTRL_PROG ;                      /*!<  PAD_CTRL_PROG register,  Address offset: 0x130 */
	__IO uint32_t RSVD4[2];                                /*!<  Reserved,  Address offset:0x134-0x138 */
	__IO uint32_t DPI_ZQ_NOCD2 ;                           /*!<  ZQ_NOCD2 register,  Address offset: 0x13C */
	__IO uint32_t DPI_PAD_ZCTRL_STATUS ;                   /*!<  PAD_ZCTRL_STATUS register,  Address offset: 0x140 */
	__I  uint32_t DPI_PAD_ZCTRL_RESULT ;                   /*!<  PAD_ZCTRL_RESULT register,  Address offset: 0x144 */
	__I  uint32_t DPI_PAD_ZCTRL_RESULT_D ;                 /*!<  PAD_ZCTRL_RESULT_D register,  Address offset: 0x148 */
	__IO uint32_t DPI_PAD_RZCTRL_STATUS ;                  /*!<  PAD_RZCTRL_STATUS register,  Address offset: 0x14C */
	__IO uint32_t DPI_DQ_DQS_CTRL ;                        /*!<  dq_dqs_ctrl register,  Address offset: 0x150 */
	__IO uint32_t DPI_CMD_ADR_PH ;                         /*!<  CMD_ADDR_PH register,  Address offset: 0x154 */
	__I  uint32_t DPI_DQ_PAT_IN0 ;                         /*!<  DQ_PAT_IN0 register,  Address offset: 0x158 */
	__I  uint32_t DPI_DQ_PAT_IN1 ;                         /*!<  DQ_PAT_IN1 register,  Address offset: 0x15C */
	__I  uint32_t DPI_WRLVL_DQS_DATA ;                     /*!<  WRLVL_DQS_DATA register,  Address offset: 0x160 */
	__IO uint32_t DPI_TEST_CTRL0 ;                         /*!<  TEST_CTRL0 register,  Address offset: 0x164 */
	__IO uint32_t DPI_TEST_CTRL1 ;                         /*!<  TEST_CTRL1 register,  Address offset: 0x168 */
	__IO uint32_t DPI_HALF_CYC_DET ;                       /*!<  HAF_CYC_DET register,  Address offset: 0x16C */
	__IO uint32_t DPI_READ_CTRL1 ;                         /*!<  READ_CTRL1 register,  Address offset: 0x170 */
	__IO uint32_t DPI_TX_RPT_CTRL ;                        /*!<  TX_RPT_CTRL register,  Address offset: 0x174 */
	__IO uint32_t DPI_CAL_SHIFT_CTRL ;                     /*!<  CAL_SHIFT_CTRL register,  Address offset: 0x178 */
	__IO uint32_t DPI_DT_SET0 ;                            /*!<  DT_SET0 register,  Address offset: 0x17C */
	__IO uint32_t DPI_ODT_TTCP0_SET0 ;                     /*!<  ODT_TTCP0_SEL0 register,  Address offset: 0x180 */
	__IO uint32_t DPI_ODT_TTCP1_SET0 ;                     /*!<  ODT_TTCP1_SEL0 register,  Address offset: 0x184 */
	__IO uint32_t DPI_ODT_TTCN0_SET0 ;                     /*!<  ODT_TTCN0_SEL0 register,  Address offset: 0x188 */
	__IO uint32_t DPI_ODT_TTCN1_SET0 ;                     /*!<  ODT_TTCN1_SEL0 register,  Address offset: 0x18C */
	__IO uint32_t DPI_OCDP0_SET0 ;                         /*!<  OCDP0_SET0 register,  Address offset: 0x190 */
	__IO uint32_t DPI_OCDP1_SET0 ;                         /*!<  OCDP1_SET0 register,  Address offset: 0x194 */
	__IO uint32_t DPI_OCDN0_SET0 ;                         /*!<  OCDN0_SET0 register,  Address offset: 0x198 */
	__IO uint32_t DPI_OCDN1_SET0 ;                         /*!<  OCDN1_SET0 register,  Address offset: 0x19C */
	__IO uint32_t DPI_ODT_TTCP0_SET1 ;                     /*!<  ODT_TTCP0_SEL1 register,  Address offset: 0x1A0 */
	__IO uint32_t DPI_ODT_TTCP1_SET1 ;                     /*!<  ODT_TTCP1_SEL1 register,  Address offset: 0x1A4 */
	__IO uint32_t DPI_ODT_TTCN0_SET1 ;                     /*!<  ODT_TTCN0_SEL1 register,  Address offset: 0x1A8 */
	__IO uint32_t DPI_ODT_TTCN1_SET1 ;                     /*!<  ODT_TTCN1_SEL1 register,  Address offset: 0x1AC */
	__IO uint32_t DPI_OCDP0_SET1 ;                         /*!<  OCDP0_SET1 register,  Address offset: 0x1B0 */
	__IO uint32_t DPI_OCDP1_SET1 ;                         /*!<  OCDP1_SET1 register,  Address offset: 0x1B4 */
	__IO uint32_t DPI_OCDN0_SET1 ;                         /*!<  OCDN0_SET1 register,  Address offset: 0x1B8 */
	__IO uint32_t DPI_OCDN1_SET1 ;                         /*!<  OCDN1_SET1 register,  Address offset: 0x1BC */
	__IO uint32_t DPI_DQ_ODT_SEL_0 ;                       /*!<  DQ_ODT_DEL_0 register,  Address offset: 0x1C0 */
	__IO uint32_t DPI_DQ_ODT_SEL_1 ;                       /*!<  DQ_ODT_DEL_1 register,  Address offset: 0x1C4 */
	__IO uint32_t DPI_DQ_OCD_SEL_0 ;                       /*!<  DQ_OCD_SEL_0 register,  Address offset: 0x1C8 */
	__IO uint32_t DPI_DQ_OCD_SEL_1 ;                       /*!<  DQ_OCD_SEL_1 register,  Address offset: 0x1CC */
	__IO uint32_t DPI_DQS_P_ODT_SEL_0 ;                    /*!<  DQS_P_ODT_SEL_0 register,  Address offset: 0x1D0 */
	__IO uint32_t DPI_DQS_P_ODT_SEL_1 ;                    /*!<  DQS_P_ODT_SEL_1 register,  Address offset: 0x1D4 */
	__IO uint32_t DPI_DQS_N_ODT_SEL_0 ;                    /*!<  DQS_N_ODT_SEL_0 register,  Address offset: 0x1D8 */
	__IO uint32_t DPI_DQS_N_ODT_SEL_1 ;                    /*!<  DQS_N_ODT_SEL_1 register,  Address offset: 0x1DC */
	__IO uint32_t DPI_DQS_OCD_SEL_0 ;                      /*!<  DQS_OCD_SEL_0 register,  Address offset: 0x1E0 */
	__IO uint32_t DPI_DQS_OCD_SEL_1 ;                      /*!<  DQS_OCD_SEL_1 register,  Address offset: 0x1E4 */
	__IO uint32_t DPI_CKE_OCD_SEL ;                        /*!<  CKE_OCD_SEL register,  Address offset: 0x1E8 */
	__IO uint32_t DPI_ADR_OCD_SEL ;                        /*!<  ADR_OCD_SEL register,  Address offset: 0x1EC */
	__IO uint32_t DPI_CK_OCD_SEL ;                         /*!<  CK_OCD_SEL register,  Address offset: 0x1F0 */
	__IO uint32_t DPI_PAD_BUS_0 ;                          /*!<  PAD_BUS_0 register,  Address offset: 0x1F4 */
	__IO uint32_t DPI_PAD_BUS_1 ;                          /*!<  PAD_BUS_1 register,  Address offset: 0x1F8 */
	__IO uint32_t DPI_PAD_BUS_2 ;                          /*!<  PAD_BUS_2 register,  Address offset: 0x1FC */
	__IO uint32_t DPI_ZQ_TRIM ;                            /*!<  ZQ_TRIM register,  Address offset: 0x200 */
	__IO uint32_t DPI_OCD_SEL_0 ;                          /*!<  OCD_SEL_0 register,  Address offset: 0x204 */
	__IO uint32_t DPI_OCD_SEL_1 ;                          /*!<  OCD_SEL_1 register,  Address offset: 0x208 */
	__IO uint32_t DPI_OCD_SEL_2 ;                          /*!<  OCD_SEL_2 register,  Address offset: 0x20C */
	__IO uint32_t DPI_OCD_SEL_3 ;                          /*!<  OCD_SEL_3 register,  Address offset: 0x210 */
	__IO uint32_t DPI_OCD_SEL_4 ;                          /*!<  OCD_SEL_4 register,  Address offset: 0x214 */
	__IO uint32_t DPI_OCD_SEL_5 ;                          /*!<  OCD_SEL_5 register,  Address offset: 0x218 */
	__IO uint32_t DPI_OCD_SEL_6 ;                          /*!<  OCD_SEL_6 register,  Address offset: 0x21C */
	__IO uint32_t DPI_OCD_SEL_7 ;                          /*!<  OCD_SEL_7 register,  Address offset: 0x220 */
	__IO uint32_t DPI_OCD_SEL_8 ;                          /*!<  OCD_SEL_8 register,  Address offset: 0x224 */
	__IO uint32_t DPI_ODT_SEL_0 ;                          /*!<  ODT_SEL_0 register,  Address offset: 0x228 */
	__IO uint32_t DPI_CKE_ODT_SEL ;                        /*!<  CKE_ODT_SEL register,  Address offset: 0x22C */
	__IO uint32_t DPI_ADR_ODT_SEL ;                        /*!<  ADR_ODT_SEL register,  Address offset: 0x230 */
	__IO uint32_t DPI_CLK_ODT_SEL ;                        /*!<  CLK_ODT_SEL register,  Address offset: 0x234 */
	__IO uint32_t DPI_DPI_CTRL_0 ;                         /*!<  DPI_CTRL_0 register,  Address offset: 0x238 */
	__IO uint32_t DPI_DPI_CTRL_1 ;                         /*!<  DPI_CTRL_1 register,  Address offset: 0x23C */
	__IO uint32_t DPI_DPI_CTRL_2 ;                         /*!<  DPI_CTRL_2 register,  Address offset: 0x240 */
	__IO uint32_t RSVD5[4];                               /*!<  Reserved,  Address offset:0x244-0x250 */
	__IO uint32_t DPI_INT_CTRL ;                           /*!<  DPI_INT_CTRL register,  Address offset: 0x254 */
	__IO uint32_t DPI_INT_STATUS_0 ;                       /*!<  DPI_INT_STATUS_0 register,  Address offset: 0x258 */
	__IO uint32_t RSVD10[15];                              /*!<  Reserved,  Address offset:0x25C-0x294 */
	__IO uint32_t DPI_CS_EMPH_CTRL ;                       /*!<  CS_EMPH_CTRL register,  Address offset: 0x298 */
	__IO uint32_t DPI_CS_SEL_EMPH_CTL ;                    /*!<  CS_SEL_EMPH_CTL register,  Address offset: 0x29C */
	__IO uint32_t DPI_DDR4_CS_EMPH_CTL ;                   /*!<  DDR4_CS_EMPH_CTL register,  Address offset: 0x2A0 */
	__IO uint32_t DPI_CK_EMPH_CTL ;                        /*!<  CK_EMPH_CTL register,  Address offset: 0x2A4 */
	__IO uint32_t DPI_CK_SEL_EMPH_CTL ;                    /*!<  CK_SEL_EMPH_CTL register,  Address offset: 0x2A8 */
	__IO uint32_t DPI_ADR_EMPH_CTL_0 ;                     /*!<  ADR_EMPH_CTL_0 register,  Address offset: 0x2AC */
	__IO uint32_t DPI_ADR_EMPH_CTL_1 ;                     /*!<  ADR_EMPH_CTL_1 register,  Address offset: 0x2B0 */
	__IO uint32_t DPI_ADR_SEL_EMPH_CTL_0 ;                 /*!<  ADR_SEL_EMPH_CTL_0 register,  Address offset: 0x2B4 */
	__IO uint32_t DPI_ADR_SEL_EMPH_CTL_1 ;                 /*!<  ADR_SEL_EMPH_CTL_1 register,  Address offset: 0x2B8 */
	__IO uint32_t DPI_ADR_EMPH_SEL_0 ;                     /*!<  ADR_EMPH_SEL_0 register,  Address offset: 0x2BC */
	__IO uint32_t DPI_ADR_EMPH_SEL_1 ;                     /*!<  ADR_EMPH_SEL_1 register,  Address offset: 0x2C0 */
	__IO uint32_t DPI_ADR_EMPH_SEL_2 ;                     /*!<  ADR_EMPH_SEL_2 register,  Address offset: 0x2C4 */
	__IO uint32_t RSVD6[8];                                /*!<  Reserved,  Address offset:0x2C8-0x2E4 */
	__IO uint32_t DPI_PAD_CTRL_ZPROG ;                     /*!<  PAD_CTRL_ZPROG register,  Address offset: 0x2E8 */
	__IO uint32_t DPI_PAD_CTRL_ZPROG_1 ;                   /*!<  PAD_CTRL_ZPROG_1 register,  Address offset: 0x2EC */
	__IO uint32_t DPI_PAD_CTRL_ZPROG_2 ;                   /*!<  PAD_CTRL_ZPROG_2 register,  Address offset: 0x2F0 */
	__IO uint32_t DPI_PAD_CTRL_ZPROG_3 ;                   /*!<  PAD_CTRL_ZPROG_3 register,  Address offset: 0x2F4 */
	__IO uint32_t DPI_PAD_CTRL_ZPROG_4 ;                   /*!<  PAD_CTRL_ZPROG_4 register,  Address offset: 0x2F8 */
	__IO uint32_t DPI_PAD_CTRL_ZPROG_5 ;                   /*!<  PAD_CTRL_ZPROG_5 register,  Address offset: 0x2FC */
	__IO uint32_t DPI_PAD_CTRL_ZPROG_6 ;                   /*!<  PAD_CTRL_ZPROG_6 register,  Address offset: 0x300 */
	__IO uint32_t DPI_PAD_CTRL_ZPROG_7 ;                   /*!<  PAD_CTRL_ZPROG_7 register,  Address offset: 0x304 */
	__IO uint32_t DPI_PAD_NOCD2_ZPROG ;                    /*!<  PAD_NOCD2_ZPROG register,  Address offset: 0x308 */
	__IO uint32_t DPI_PAD_NOCD2_ZPROG_1 ;                  /*!<  PAD_NOCD2_ZPROG_1 register,  Address offset: 0x30C */
	__IO uint32_t DPI_PAD_NOCD2_ZPROG_2 ;                  /*!<  PAD_NOCD2_ZPROG_2 register,  Address offset: 0x310 */
	__IO uint32_t DPI_PAD_NOCD2_ZPROG_3 ;                  /*!<  PAD_NOCD2_ZPROG_3 register,  Address offset: 0x314 */
	__IO uint32_t DPI_PAD_NOCD2_ZPROG_4 ;                  /*!<  PAD_NOCD2_ZPROG_4 register,  Address offset: 0x318 */
	__IO uint32_t DPI_PAD_NOCD2_ZPROG_5 ;                  /*!<  PAD_NOCD2_ZPROG_5 register,  Address offset: 0x31C */
	__IO uint32_t DPI_PAD_NOCD2_ZPROG_6 ;                  /*!<  PAD_NOCD2_ZPROG_6 register,  Address offset: 0x320 */
	__IO uint32_t DPI_PAD_NOCD2_ZPROG_7 ;                  /*!<  PAD_NOCD2_ZPROG_7 register,  Address offset: 0x324 */
	__IO uint32_t DPI_DQ_OCD_SEL2_0 ;                      /*!<  DQ_OCD_SEL2_0 register,  Address offset: 0x328 */
	__IO uint32_t DPI_DQ_OCD_SEL2_1 ;                      /*!<  DQ_OCD_SEL2_1 register,  Address offset: 0x32C */
	__IO uint32_t DPI_DQS_OCD_SEL2_0 ;                     /*!<  DQS_OCD_SEL2_0 register,  Address offset: 0x330 */
	__IO uint32_t DPI_DQS_OCD_SEL2_1 ;                     /*!<  DQS_OCD_SEL2_1 register,  Address offset: 0x334 */
	__IO uint32_t RSVD7[52];                               /*!<  Reserved,  Address offset:0x338-0x404 */
	__IO uint32_t DPI_READ_CTRL2 ;                         /*!<  READ_CTRL2 register,  Address offset: 0x408 */
	__IO uint32_t DPI_READ_CTRL2_1 ;                       /*!<  READ_CTRL2_1 register,  Address offset: 0x40C */
	__IO uint32_t DPI_READ_CTRL3 ;                         /*!<  READ_CTRL3 register,  Address offset: 0x410 */
	__IO uint32_t DPI_READ_CTRL3_1 ;                       /*!<  READ_CTRL3_1 register,  Address offset: 0x414 */
	__IO uint32_t DPI_READ_CTRL6 ;                         /*!<  READ_CTRL6 register,  Address offset: 0x418 */
	__IO uint32_t DPI_READ_CTRL6_1 ;                       /*!<  READ_CTRL6_1 register,  Address offset: 0x41C */
	__IO uint32_t DPI_DQS_IN_DLY0 ;                        /*!<  DQS_IN_DLY0 register,  Address offset: 0x420 */
	__IO uint32_t DPI_DQS_IN_DLY0_1 ;                      /*!<  DQS_IN_DLY0_1 register,  Address offset: 0x424 */
	__IO uint32_t DPI_DQS_IN_DLY1 ;                        /*!<  DQS_IN_DLY1 register,  Address offset: 0x428 */
	__IO uint32_t DPI_DQS_IN_DLY1_1 ;                      /*!<  DQS_IN_DLY1_1 register,  Address offset: 0x42C */
	__IO uint32_t DPI_DQS_IN_DLY1_DBI ;                    /*!<  DQS_IN_DLY1_DBI register,  Address offset: 0x430 */
	__IO uint32_t DPI_DQS_IN_DLY1_DBI_1 ;                  /*!<  DQS_IN_DLY1_DBI_1 register,  Address offset: 0x434 */
	__IO uint32_t DPI_DQS_IN_DLY2 ;                        /*!<  DQS_IN_DLY2 register,  Address offset: 0x438 */
	__IO uint32_t DPI_DQS_IN_DLY2_1 ;                      /*!<  DQS_IN_DLY2_1 register,  Address offset: 0x43C */
	__IO uint32_t DPI_DQS_IN_DLY3 ;                        /*!<  DQS_IN_DLY3 register,  Address offset: 0x440 */
	__IO uint32_t DPI_DQS_IN_DLY3_1 ;                      /*!<  DQS_IN_DLY3_1 register,  Address offset: 0x444 */
	__IO uint32_t DPI_DQS_IN_DLY3_DBI ;                    /*!<  DQS_IN_DLY3_DBI register,  Address offset: 0x448 */
	__IO uint32_t DPI_DQS_IN_DLY3_DBI_1 ;                  /*!<  DQS_IN_DLY3_DBI_1 register,  Address offset: 0x44C */
	__IO uint32_t DPI_VALID_WIN_DET_PFIFO ;                /*!<  VALID_WIN_DET_PFIFO register,  Address offset: 0x450 */
	__IO uint32_t DPI_VALID_WIN_DET_PFIFO_1 ;              /*!<  VALID_WIN_DET_PFIFO_1 register,  Address offset: 0x454 */
	__IO uint32_t DPI_VALID_WIN_DET_NFIFO ;                /*!<  VALID_WIN_DET_NFIFO register,  Address offset: 0x458 */
	__IO uint32_t DPI_VALID_WIN_DET_NFIFO_1 ;              /*!<  VALID_WIN_DET_NFIFO_1 register,  Address offset: 0x45C */
	__IO uint32_t DPI_DQ_DLY_0 ;                           /*!<  DQ_DLY_0 register,  Address offset: 0x460 */
	__IO uint32_t DPI_DQ_DLY_0_1 ;                         /*!<  DQ_DLY_0_1 register,  Address offset: 0x464 */
	__IO uint32_t DPI_DQ_DLY_1 ;                           /*!<  DQ_DLY_1 register,  Address offset: 0x468 */
	__IO uint32_t DPI_DQ_DLY_1_1 ;                         /*!<  DQ_DLY_1_1 register,  Address offset: 0x46C */
	__I  uint32_t DPI_CAL_OUT_0 ;                          /*!<  CAL_OUT_0 register,  Address offset: 0x470 */
	__IO uint32_t DPI_CAL_OUT_0_1 ;                        /*!<  CAL_OUT_0_1 register,  Address offset: 0x474 */
	__I  uint32_t DPI_WR_FIFO_0 ;                          /*!<  WR_FIFO_0 register,  Address offset: 0x478 */
	__I  uint32_t DPI_WR_FIFO_0_1 ;                        /*!<  WR_FIFO_0_1 register,  Address offset: 0x47C */
	__I  uint32_t DPI_WR_FIFO_1 ;                          /*!<  WR_FIFO_1 register,  Address offset: 0x480 */
	__I  uint32_t DPI_WR_FIFO_1_1 ;                        /*!<  WR_FIFO_1_1 register,  Address offset: 0x484 */
	__I  uint32_t DPI_RD_FIFO_0 ;                          /*!<  RD_FIFO_0 register,  Address offset: 0x488 */
	__I  uint32_t DPI_RD_FIFO_0_1 ;                        /*!<  RD_FIFO_0_1 register,  Address offset: 0x48C */
	__I  uint32_t DPI_RD_FIFO_1 ;                          /*!<  RD_FIFO_1 register,  Address offset: 0x490 */
	__I  uint32_t DPI_RD_FIFO_1_1 ;                        /*!<  RD_FIFO_1_1 register,  Address offset: 0x494 */
	__I  uint32_t DPI_DBI_FIFO ;                           /*!<  DBI_FIFO register,  Address offset: 0x498 */
	__I  uint32_t DPI_DBI_FIFO_1 ;                         /*!<  DBI_FIFO_1 register,  Address offset: 0x49C */
	__IO uint32_t DPI_INT_STATUS_1 ;                       /*!<  INT_STATUS_1 register,  Address offset: 0x4A0 */
	__IO uint32_t DPI_INT_STATUS_1_1 ;                     /*!<  INT_STATUS_1_1 register,  Address offset: 0x4A4 */
	__IO uint32_t DPI_INT_STATUS_3 ;                       /*!<  INT_STATUS_3 register,  Address offset: 0x4A8 */
	__IO uint32_t DPI_INT_STATUS_3_1 ;                     /*!<  INT_STATUS_3_1 register,  Address offset: 0x4AC */
	__IO uint32_t RSVD8[2];                                /*!<  Reserved,  Address offset:0x4B0-0x4B4 */
	__IO uint32_t DPI_PRBS_TMUX4 ;                         /*!<  PRBS_TMUX4 register,  Address offset: 0x4B8 */
	__IO uint32_t DPI_PRBS_TMUX4_1 ;                       /*!<  PRBS_TMUX4_1 register,  Address offset: 0x4BC */
	__IO uint32_t DPI_PRBS_TMUX5 ;                         /*!<  PRBS_TMUX5 register,  Address offset: 0x4C0 */
	__IO uint32_t DPI_PRBS_TMUX5_1 ;                       /*!<  PRBS_TMUX5_1 register,  Address offset: 0x4C4 */
	__IO uint32_t DPI_RW_EMPH_CTL ;                        /*!<  RW_EMPH_CTL register,  Address offset: 0x4C8 */
	__IO uint32_t DPI_RW_EMPH_CTL_1 ;                      /*!<  RW_EMPH_CTL_1 register,  Address offset: 0x4CC */
	__IO uint32_t DPI_RW_SEL_EMPH_CTL ;                    /*!<  RW_SEL_EMPH_CTL register,  Address offset: 0x4D0 */
	__IO uint32_t DPI_RW_SEL_EMPH_CTL_1 ;                  /*!<  RW_SEL_EMPH_CTL_1 register,  Address offset: 0x4D4 */
	__IO uint32_t DPI_DQ_IO_CTL_0 ;                        /*!<  DQ_IO_CTL_0 register,  Address offset: 0x4D8 */
	__IO uint32_t DPI_DQ_IO_CTL_0_1 ;                      /*!<  DQ_IO_CTL_0_1 register,  Address offset: 0x4DC */
	__IO uint32_t DPI_DQ_IO_CTL_1 ;                        /*!<  DQ_IO_CTL_1 register,  Address offset: 0x4E0 */
	__IO uint32_t DPI_DQ_IO_CTL_1_1 ;                      /*!<  DQ_IO_CTL_1_1 register,  Address offset: 0x4E4 */
	__IO uint32_t DPI_READ_DBG_CTRL ;                      /*!<  READ_DBG_CTRL register,  Address offset: 0x4E8 */
	__IO uint32_t DPI_READ_DBG_CTRL_1 ;                    /*!<  READ_DBG_CTRL_1 register,  Address offset: 0x4EC */
	__I  uint32_t DPI_MON ;                                /*!<  MON register,  Address offset: 0x4F0 */
