Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dpi_type.h
	__I  uint32_t DPI_MON_1 ;                              /*!<  MON_1 register,  Address offset: 0x4F4 */
	__IO uint32_t DPI_CAL_LS_SEL ;                         /*!<  CAL_LS_SEL register,  Address offset: 0x4F8 */
	__IO uint32_t DPI_CAL_LS_SEL_1 ;                       /*!<  CAL_LS_SEL_1 register,  Address offset: 0x4FC */
	__IO uint32_t DPI_CAL_LS_SEL_DBI ;                     /*!<  CAL_LS_SEL_DBI register,  Address offset: 0x500 */
	__IO uint32_t DPI_CAL_LS_SEL_DBI_1 ;                   /*!<  CAL_LS_SEL_DBI_1 register,  Address offset: 0x504 */
	__IO uint32_t DPI_CAL_RS_SEL ;                         /*!<  CAL_RS_SEL register,  Address offset: 0x508 */
	__IO uint32_t DPI_CAL_RS_SEL_1 ;                       /*!<  CAL_RS_SEL_1 register,  Address offset: 0x50C */
	__IO uint32_t DPI_CAL_RS_SEL_DBI ;                     /*!<  CAL_RS_SEL_DBI register,  Address offset: 0x510 */
	__IO uint32_t DPI_CAL_RS_SEL_DBI_1 ;                   /*!<  CAL_RS_SEL_DBI_1 register,  Address offset: 0x514 */
	__IO uint32_t DPI_DQ_IO_CTL_2 ;                        /*!<  DQ_IO_CTL_2 register,  Address offset: 0x518 */
	__IO uint32_t DPI_DQ_IO_CTL_2_1 ;                      /*!<  DQ_IO_CTL_2_1 register,  Address offset: 0x51C */
	__IO uint32_t DPI_READ_CTRL_4 ;                        /*!<  READ_CTRL_4 register,  Address offset: 0x520 */
	__IO uint32_t DPI_READ_CTRL_4_1 ;                      /*!<  READ_CTRL_4_1 register,  Address offset: 0x524 */
	__IO uint32_t RSVD9[52];                               /*!<  Reserved,  Address offset:0x528-0x5F4 */
	__IO uint32_t DPI_READ_CTRL_0_0 ;                      /*!<  READ_CTRL_0_0 register,  Address offset: 0x5F8 */
	__IO uint32_t DPI_READ_CTRL_0_1 ;                      /*!<  READ_CTRL_0_1 register,         Address offset: 0x5FC */
} DPI_TypeDef;
/** @} */

#endif
